import { DndClass } from '../../types/dnd';

export const classes: DndClass[] = [
  {
    "id": "barbarian",
    "name": "野蛮人",
    "description": "一个能进入战斗狂怒的勇猛狂战士。他们拥有与自然和动物连系的图腾精魂，或仅仅凭借自身的无匹力量，挥舞巨大的武器在战场上粉碎敌人。在狂暴中，他们将感受到痛觉麻木，并爆发出惊人的力量。",
    "hitDie": 12,
    "primaryAbility": [
      "STR"
    ],
    "saves": [
      "STR",
      "CON"
    ],
    "armorProficiencies": [
      "轻甲",
      "中甲",
      "盾牌"
    ],
    "weaponProficiencies": [
      "简易武器",
      "军用武器"
    ],
    "toolProficiencies": [],
    "skills": {
      "count": 2,
      "choices": [
        "驯兽",
        "运动",
        "威吓",
        "自然",
        "察觉",
        "生存"
      ]
    },
    "startingEquipment": [
      "(a)一把巨斧 或 (b)任意一把军用近战武器",
      "(a)二把手斧 或 (b)任意一把简易武器",
      "一套探索者套装，和四把标枪"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "barbarian-skills",
            "name": "选择 2 个技能熟练",
            "chooseNumber": 2,
            "options": [
              {
                "id": "animalHandling",
                "name": "驯兽"
              },
              {
                "id": "athletics",
                "name": "运动"
              },
              {
                "id": "intimidation",
                "name": "威吓"
              },
              {
                "id": "nature",
                "name": "自然"
              },
              {
                "id": "perception",
                "name": "察觉"
              },
              {
                "id": "survival",
                "name": "生存"
              }
            ]
          },
          {
            "id": "barbarian-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把巨斧"
              },
              {
                "id": "opt-1",
                "name": "(b)任意一把军用近战武器"
              }
            ]
          },
          {
            "id": "barbarian-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)二把手斧"
              },
              {
                "id": "opt-1",
                "name": "(b)任意一把简易武器"
              }
            ]
          },
          {
            "id": "barbarian-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "狂暴",
        "description": "在战斗中，你带着原初的狂怒作战。在你的回合，你能够以一个附赠动作进入狂暴。当处于狂暴时，若你未穿戴重甲，你获得下列好处：你在力量检定和力量豁免中具有优势。当你进行一次使用力量的近战武器攻击时，你在伤害骰上获得+2加值。这个加值会随着你的等级而增加。你对钝击、穿刺、和挥砍伤害具有抗性。若你能够施放法术，则你在狂暴期间无法施放它们或维持法术上的专注。你的狂暴持续1分钟。它会在你被击倒昏迷时提前结束，或若你从上回合到这回合结束时都没有攻击一个敌意生物或受到伤害，则狂暴也将提前结束。你也可以在你的回合以一个附赠动作结束你的狂暴。一旦你狂暴的次数达到你当前野蛮人等级所能狂暴的最大次数，你就必须要完成一次长休才能够再次狂暴。你在1级时可以狂暴二次，3级时三次，6级时四次，12级时五次，以及17级时六次。",
        "level": 1
      },
      {
        "name": "无甲防御",
        "description": "当你未穿戴护甲时，你的AC等于10 + 你的敏捷调整值 + 你的体质调整值。你可以使用盾牌而仍获得这个好处。",
        "level": 1
      },
      {
        "name": "险境感知",
        "description": "在2级时，你获得一种能查觉到周遭异状的超常感知能力，让你在躲避危险时掌握先机。你在对抗你所能见的效果时所进行的敏捷豁免中具有优势，像是陷阱和法术。要获得此好处，你不能处于目盲、耳聋或无力状态。",
        "level": 2
      },
      {
        "name": "鲁莽攻击",
        "description": "从2级开始，你可以抛下防御以展开不顾一切的猛烈攻击。当你在你的回合进行你的第一次攻击时，你可以选择鲁莽地攻击。这么做会让你在该回合间所有使用力量的近战武器攻击检定具有优势，但直到你的下个回合，所有对你进行的攻击检定也将具有优势。",
        "level": 2
      },
      {
        "name": "原初道途",
        "description": "在3级时，你从可选道途列表中选择一种形塑你愤怒本质的道途。你的选择将在3级、6级、10级、和14级时赋予你新的能力。",
        "level": 3
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至4级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 4,
        "choices": [
          {
            "id": "barbarian-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "额外攻击",
        "description": "从5级开始，每当你在自己回合执行攻击动作时，你可以发动两次攻击，而非一次。",
        "level": 5
      },
      {
        "name": "快速移动",
        "description": "从5级开始，当你未穿戴重甲时，你的移动速度增加10尺。",
        "level": 5
      },
      {
        "name": "道途能力",
        "description": "在6级时，你获得一个来自你原初道途的能力。",
        "level": 6
      },
      {
        "name": "野性直觉",
        "description": "从7级起，你的直觉是如此犀利，你在先攻骰中具有优势。此外，若你在战斗开始时被突袭且未陷入无力状态，则你可以在你的第一个回合中如常行动。若你这么做，你必须在该回合进行任何行动前进入狂暴。",
        "level": 7
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至8级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 8,
        "choices": [
          {
            "id": "barbarian-asi-8",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "凶蛮重击(1颗骰)",
        "description": "从9级开始，你可以在决定近战攻击的重击所造成的额外伤害时额外骰一颗武器伤害骰。这个能力会在13级时增加至二颗额外的伤害骰，在17级时增加至三颗额外的伤害骰。",
        "level": 9
      },
      {
        "name": "道途能力",
        "description": "在10级时，你获得一个来自你原初道途的能力。",
        "level": 10
      },
      {
        "name": "顽强狂暴",
        "description": "从11级开始，你的狂暴让你即使身受重伤也可以持续战斗。若你在狂暴中生命值归零而没有立即死亡，则你可以进行一次DC 10的体质豁免。若豁免成功，则改为将你的生命值减少至1。在你首次使用此能力后的每次，这个豁免检定的DC都会增加5。当你完成一次短休或长休后，这个豁免检定的DC将会重置为10。",
        "level": 11
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至12级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 12,
        "choices": [
          {
            "id": "barbarian-asi-12",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "凶蛮重击(2颗骰)",
        "description": "在13级时，你可以在决定近战攻击的重击所造成的额外伤害时额外骰二颗武器伤害骰。这个能力会在17级时增加至三颗额外的伤害骰。",
        "level": 13
      },
      {
        "name": "道途能力",
        "description": "在14级时，你获得一个来自你原初道途的能力。",
        "level": 14
      },
      {
        "name": "持久狂暴",
        "description": "从15级开始，你的狂暴是如此猛烈，以至于它只会在你陷入昏迷或你选择结束它时提早结束。",
        "level": 15
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至16级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 16,
        "choices": [
          {
            "id": "barbarian-asi-16",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "凶蛮重击(3颗骰)",
        "description": "在17级时，你可以在决定近战攻击的重击所造成的额外伤害时额外骰三颗武器伤害骰。",
        "level": 17
      },
      {
        "name": "不屈勇武",
        "description": "从18级开始，若你力量检定的总值低于你的力量值，则你可以使用该数值以取代该力量检定的总值。",
        "level": 18
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至19级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 19,
        "choices": [
          {
            "id": "barbarian-asi-19",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "原初勇士",
        "description": "在20级时，你本身的存在就体现了荒野的力量。你的力量和体质增加4点。你这些数值的上限现在变更为24。",
        "level": 20
      }
    ],
    "subclassAvailableAtLevel": 3,
    "subclasses": [
      {
        "id": "berserker",
        "name": "狂战士道途",
        "description": "对某些野蛮人来说，狂暴是一种达到极致的方式—暴力的极致。狂战士道途是一条追求鲜血与无拘狂怒的道路。随着你进入狂战士的狂暴时，你将在战斗的混乱快感中颤栗，舍身忘怀自己的安危。",
        "traits": [
          {
            "name": "狂怒",
            "description": "你可以在狂暴时进入狂怒。若你这么做，则在你狂暴期间，你可以在这之后的你的每个回合以一个附赠动作进行一次近战武器攻击。当你的狂暴结束时，你将承受一级的力竭状态。",
            "level": 3
          },
          {
            "name": "无我狂暴",
            "description": "你在狂暴期间不会被魅惑或恐惧。若你在进入狂暴时已经被魅惑或恐惧，则该效果将在狂暴期间被压制。",
            "level": 6
          },
          {
            "name": "威慑之姿",
            "description": "你可以使用你的动作以用你那可怖的姿态恐吓他人。当你这么做时，选择一个距离你30尺内且你所能看见的生物。若该生物可以看见或听见你，则它必须成功通过一次感知豁免（DC等同于8 + 你的熟练加值 + 你的魅力调整值），否则将被你恐惧直到你的下个回合结束。在后续的回合，你可以使用你的动作使这个效果对被恐惧生物的影响延长到你的下个回合结束。这个效果会在该生物离开你的视野，或离开你超过60尺距离时结束。若该生物成功通过该豁免检定，则你在接下来的24小时内都不能再对该生物使用此能力。",
            "level": 10
          },
          {
            "name": "复仇",
            "description": "当你受到来自一个距离你５尺内生物的伤害时，你可以使用你的反应以对该生物进行一次近战武器攻击。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "totem-warrior",
        "name": "图腾勇士道途",
        "description": "图腾勇士的道途是一趟灵魂修炼的旅程，野蛮人将接受一种精魂野兽作为向导、保护者、和启发者。在战斗中，你的图腾精魂将超自然的力量灌输于你，为你的狂暴注入魔法力量。",
        "traits": [
          {
            "name": "精魂寻访者",
            "description": "你追求于与大自然调和知道，使你与动物创建了亲密的关系。你获得施放野兽知觉和动物交谈术法术的能力，但只能通过仪式施展，参见第十章的描述。",
            "level": 3
          },
          {
            "name": "图腾精魂",
            "description": "当你选择此道途时，你选择一种图腾精魂并获得它的能力。你必须制造或获得一个象征图腾野兽的兽毛、翼羽、利爪、牙齿、或骨头的图腾物体—例如护身符或其他类似的饰品。熊：当狂暴时，你对除了心灵伤害以外的所有伤害具有抗性。鹰：当你狂暴且未穿着重甲时，其他生物对你所进行的借机攻击将具有劣势，且你可以在你的回合以一个附赠动作使用疾走动作。狼：当你狂暴时，你的盟友在对任何距离你5尺内且对你有敌意的生物所进行的近战攻击检定具有优势。",
            "level": 3,
        "choices": [
          {
            "id": "totem-spirit-3",
            "name": "选择图腾精魂",
            "chooseNumber": 1,
            "options": [
              { "id": "bear", "name": "熊", "description": "当狂暴时，你对除了心灵伤害以外的所有伤害具有抗性。" },
              { "id": "eagle", "name": "鹰", "description": "当你狂暴且未穿着重甲时，其他生物对你所进行的借机攻击将具有劣势，且你可以在你的回合以一个附赠动作使用疾走动作。" },
              { "id": "wolf", "name": "狼", "description": "当你狂暴时，你的盟友在对任何距离你5尺内且对你有敌意的生物所进行的近战攻击检定具有优势。" }
            ]
          }
        ]
          },
          {
            "name": "兽之形",
            "description": "你获得一个基于你所选图腾动物的魔法益处。你可以选择一个与你在3级时所选相同或不同的动物。熊：你获得熊之力量。你的负载能力（包括最大负重和最大举重）变为两倍，且你在拖曳、推动、提举、或破坏物体时所进行的力量检定将具有优势。鹰：你获得鹰之锐目。你可以毫无困难地看见最远1里的距离，甚至能辨别出最细微的细节，就如同在查看距离你不超过100尺的事物一样。此外，微光光照并不会使你的感知（察觉）检定承受劣势。狼：你获得狼的狩猎敏锐。你能够以快速步速追踪其他生物，且你能够以正常步速隐匿移动。",
            "level": 6,
        "choices": [
          {
            "id": "totem-spirit-6",
            "name": "选择兽之形图腾",
            "chooseNumber": 1,
            "options": [
              { "id": "bear", "name": "熊", "description": "负载能力变为两倍，在拖曳、推动、提举力量检定中具有优势。" },
              { "id": "eagle", "name": "鹰", "description": "能看见1里外事物如同100尺。微光光照不会使察觉检定劣势。" },
              { "id": "wolf", "name": "狼", "description": "能以快速步速追踪其他生物且隐匿移动。" }
            ]
          }
        ]
          },
          {
            "name": "精魂行者",
            "description": "你可以施放问道自然法术，但只能通过仪式施展。当你这么做时，你在图腾精魂或兽之形所选择的其中一种动物的灵体版本将会出现并传达你所寻求的信息。",
            "level": 10
          },
          {
            "name": "图腾调律",
            "description": "你获得一个基于你所选图腾动物的魔法益处。你可以选择一个与你先前所选相同或不同的动物。熊：当你狂暴时，任何距离你5尺内且对你有敌意的生物，将在对你或其他拥有此能力生物以外的目标所进行的攻击检定中具有劣势。鹰：当狂暴时，你将具有等同于你步行速度的飞行速度。这个好处只会在短时间作用；若你在空中结束你的回合且没有其他东西让你维持浮空，则你将坠落。狼：当你狂暴时，当你在你的回合以一次近战武器攻击命中一个体型为大型或更小的生物时，你可以使用一个附赠动作以将它击倒伏地。",
            "level": 14
          }
        ],
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "STR",
          "min": 13
        }
      ],
      "proficiencies": {
        "armor": [
          "盾牌"
        ],
        "weapons": [
          "简易武器",
          "军用武器"
        ]
      }
    }
  },
  {
    "id": "bard",
    "name": "吟游诗人",
    "description": "用音乐和演说编织出魔法的鼓舞人心之创作者。他们是极具魅力的吟游者或艺术家，漫游于世界收集各样的传说与知识。无论在战斗中的振奋激励还是施展控制思想与治疗创伤的法术，他们都是多才多艺的支援者。",
    "hitDie": 8,
    "primaryAbility": [
      "CHA"
    ],
    "saves": [
      "DEX",
      "CHA"
    ],
    "armorProficiencies": [
      "轻甲"
    ],
    "weaponProficiencies": [
      "简易武器",
      "手弩",
      "长剑",
      "刺剑",
      "短剑"
    ],
    "toolProficiencies": [
      "三种你所选择的乐器"
    ],
    "skills": {
      "count": 3,
      "choices": [
        "任意技能"
      ]
    },
    "startingEquipment": [
      "(a)一把刺剑, (b)一把长剑, 或 (c)任何一把简易武器",
      "(a)一套大使套装 或 (b)一套表演家套装",
      "(a)一把鲁特琴 或 (b)任何一把其他乐器",
      "一件皮甲，以及一把匕首"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "bard-skills",
            "name": "选择 3 个技能熟练",
            "chooseNumber": 3,
            "options": [
              {
                "id": "acrobatics",
                "name": "特技"
              },
              {
                "id": "animalHandling",
                "name": "驯兽"
              },
              {
                "id": "arcana",
                "name": "奥秘"
              },
              {
                "id": "athletics",
                "name": "运动"
              },
              {
                "id": "deception",
                "name": "欺瞒"
              },
              {
                "id": "history",
                "name": "历史"
              },
              {
                "id": "insight",
                "name": "洞悉"
              },
              {
                "id": "intimidation",
                "name": "威吓"
              },
              {
                "id": "investigation",
                "name": "调查"
              },
              {
                "id": "medicine",
                "name": "医药"
              },
              {
                "id": "nature",
                "name": "自然"
              },
              {
                "id": "perception",
                "name": "察觉"
              },
              {
                "id": "performance",
                "name": "表演"
              },
              {
                "id": "persuasion",
                "name": "说服"
              },
              {
                "id": "religion",
                "name": "宗教"
              },
              {
                "id": "sleightOfHand",
                "name": "巧手"
              },
              {
                "id": "stealth",
                "name": "隐匿"
              },
              {
                "id": "survival",
                "name": "生存"
              }
            ]
          },
          {
            "id": "bard-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把刺剑"
              },
              {
                "id": "opt-1",
                "name": "(b)一把长剑"
              },
              {
                "id": "opt-2",
                "name": "(c)任何一把简易武器"
              }
            ]
          },
          {
            "id": "bard-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一套大使套装"
              },
              {
                "id": "opt-1",
                "name": "(b)一套表演家套装"
              }
            ]
          },
          {
            "id": "bard-equip-2",
            "name": "装备组 3 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把鲁特琴"
              },
              {
                "id": "opt-1",
                "name": "(b)任何一把其他乐器"
              }
            ]
          },
          {
            "id": "bard-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "吟游激励 (d6)",
        "description": "你可以用振奋人心的言词或音乐来激励其他生物。在你的回合中使用一个附赠动作来选择一个除你之外，距离你60尺内且可以听见你的生物，该生物获得一个吟游激励骰d6。在接下来的10分钟内，该生物可以骰这颗激励骰，并将骰出来的数字加到它所进行的一次属性检定、攻击检定、或豁免检定中。该生物可以在骰d20之后才决定是否使用使用吟游激励骰，但必须在DM宣布该检定结果之前使用。一旦吟游激励骰被使用，它就消失。且一个生物同时只能拥有一颗吟游激励骰。你可以使用这个能力的次数等同于你的魅力调整值（最少为1）。你在完成一次长休后恢复所有你花费掉的次数。你的吟游激励骰会在你本职业升至特定等级时改变。在5级的时候变为d8、10级时d10、15级时d12。",
        "level": 1
      },
      {
        "name": "施法",
        "description": "你习得用音乐和意志来解构并重塑现实的力量。戏法：你知晓两个从吟游诗人法术列表自选的戏法。法术位：吟游诗人表中显示了你有多少个法术位。一环或更高环的已知法术：你知晓四个从吟游诗人法术列表中自选的1环法术。",
        "level": 1,
        "choices": [
          {
            "id": "spells-step-cantrips",
            "name": "选择两个吟游诗人戏法",
            "chooseNumber": 2,
            "dynamic": "spell",
            "spellType": "cantrip",
            "spellList": "bard"
          },
          {
            "id": "spells-step-leveled",
            "name": "选择四个1环吟游诗人法术",
            "chooseNumber": 4,
            "dynamic": "spell",
            "spellType": "known",
            "spellList": "bard",
            "maxLevel": 1
          }
        ]
      },
      {
        "name": "全能高手",
        "description": "从2级开始，你可以将你熟练加值的一半（向下取整）加入任何你尚未熟练的属性检定中。",
        "level": 2
      },
      {
        "name": "纾压曲 (d6)",
        "description": "从2级开始，你可以在短休期间利用安抚人心的音乐或演说来使你受伤的队友恢复活力。若你或任何可以听见你表演的生物在短休结束时借由消耗生命骰回复生命值，则每个这么做的生物回复额外的1d6生命值。",
        "level": 2
      },
      {
        "name": "吟游学院",
        "description": "在3级时，你从可选的学院列表中选择一个吟游诗人学院来深入你的技巧。这个选择会在3级、6级、和14级的时候赋予你新的能力。",
        "level": 3
      },
      {
        "name": "专精",
        "description": "在3级时，选择两个你的技能熟练，你的熟练加值在使用所选熟练项所进行的任何属性检定中变为两倍。在10级时，你可以再选择另外两个技能熟练以获得这个好处。",
        "level": 3,
        "choices": [
          {
            "id": "bard-expertise-3",
            "name": "选择两项熟练获得专精（需已拥有熟练）",
            "chooseNumber": 2,
            "dynamic": "expertise"
          }
        ]
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至4级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 4,
        "choices": [
          {
            "id": "bard-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "吟游激励 (d8)",
        "description": "在5级时，你的吟游激励骰变更为d8。",
        "level": 5
      },
      {
        "name": "激励涌泉",
        "description": "从你升至5级开始，你在完成一次短休或长休后都会恢复所有你在吟游激励骰花费掉的次数。",
        "level": 5
      },
      {
        "name": "反制迷惑",
        "description": "在6级时，你获得使用音乐或言语的力量来干扰会影响心灵效果的能力。以一个动作，你可以开始一段持续到你下个回合结束的表演。在这段期间，你和任何与你距离30尺内的友善生物在对抗恐惧或魅惑的豁免检定中获得优势。只有能听见你的生物可以获得此效果。这段表演将在你陷入无力、被沉默、或是你自愿停止（不需要动作）时提早结束。",
        "level": 6
      },
      {
        "name": "学院能力",
        "description": "在6级时，你获得一个来自你吟游诗人学院的能力。",
        "level": 6
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至8级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 8,
        "choices": [
          {
            "id": "bard-asi-8",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "纾压曲 (d8)",
        "description": "在9级时，纾压曲所给予的额外生命值增加至1d8。",
        "level": 9
      },
      {
        "name": "吟游激励 (d10)",
        "description": "在10级时，你的吟游激励骰变更为d10。",
        "level": 10
      },
      {
        "name": "魔法秘密",
        "description": "在10级时，你从广泛的学科中掠夺了它们的魔法知识。从任意职业中（包括本职业）中选择二个法术。你所选择的法术必须要是你所能施放的环阶（见吟游诗人表），或者是戏法。对你而言，所选的法术将被视为吟游诗人法术，且会被算在吟游诗人表中的已知法术数量中。你将会在14级和18级时再从任意职业中学会二个额外法术。",
        "level": 10,
        "choices": [
          {
            "id": "bard-magical-secrets-10",
            "name": "魔法秘密：选择二个法术",
            "chooseNumber": 2,
            "dynamic": "custom-spells"
          }
        ]
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至12级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 12,
        "choices": [
          {
            "id": "bard-asi-12",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "纾压曲 (d10)",
        "description": "在13级时，纾压曲所给予的额外生命值增加至1d10。",
        "level": 13
      },
      {
        "name": "魔法秘密",
        "description": "在14级时，从任意职业中（包括本职业）额外选择二个法术。你所选择的法术必须要是你所能施放的环阶（见吟游诗人表），或者是戏法。对你而言，所选的法术将被视为吟游诗人法术，且会被算在吟游诗人表中的已知法术数量中。",
        "level": 14,
        "choices": [
          {
            "id": "bard-magical-secrets-14",
            "name": "魔法秘密：额外选择二个法术",
            "chooseNumber": 2,
            "dynamic": "custom-spells"
          }
        ]
      },
      {
        "name": "学院能力",
        "description": "在14级时，你获得一个来自你吟游诗人学院的能力。",
        "level": 14
      },
      {
        "name": "吟游激励 (d12)",
        "description": "在15级时，你的吟游激励骰变更为d12。",
        "level": 15
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至16级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 16,
        "choices": [
          {
            "id": "bard-asi-16",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "纾压曲 (d12)",
        "description": "在17级时，纾压曲所给予的额外生命值增加至1d12。",
        "level": 17
      },
      {
        "name": "魔法秘密",
        "description": "在18级时，从任意职业中（包括本职业）额外选择二个法术。你所选择的法术必须要是你所能施放的环阶（见吟游诗人表），或者是戏法。对你而言，所选的法术将被视为吟游诗人法术，且会被算在吟游诗人表中的已知法术数量中。",
        "level": 18,
        "choices": [
          {
            "id": "bard-magical-secrets-18",
            "name": "魔法秘密：再次选择二个法术",
            "chooseNumber": 2,
            "dynamic": "custom-spells"
          }
        ]
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至19级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 19,
        "choices": [
          {
            "id": "bard-asi-19",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "卓越激励",
        "description": "在20级时，当你骰先攻时且吟游激励骰已经没有剩下的使用次数，则你获得一次使用次数。",
        "level": 20
      }
    ],
    "spellcasting": {
      "type": "known",
      "ability": "CHA",
      "cantripsKnown": [
        2,
        2,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      "spellsKnown": [
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        14,
        15,
        15,
        16,
        18,
        19,
        19,
        20,
        22,
        22,
        22
      ],
      "spellSlots": [
        [
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          3,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          2,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          1,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          2,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          1,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          1,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          2,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          2,
          2,
          1,
          1
        ]
      ],
      "spellList": "bard"
    },
    "subclassAvailableAtLevel": 3,
    "subclasses": [
      {
        "id": "lore",
        "name": "轶闻学院",
        "description": "轶闻学院的吟游诗人知晓大部分的事情，并从各式各样的来源，从学术典籍到乡野奇谈，搜集种种不同的轶闻。无论是酒馆中的歌唱家、或是皇室宫廷里的作曲家，这些诗人都会运用他们的天赋让观众们入迷。",
        "traits": [
          {
            "name": "额外熟练",
            "description": "你获得三个自选技能的熟练。",
            "level": 3,
            "choices": [
              {
                "id": "lore-bard-skills",
                "name": "选择三个技能",
                "chooseNumber": 3,
                "options": [
                  {
                    "id": "acrobatics",
                    "name": "特技"
                  },
                  {
                    "id": "animalHandling",
                    "name": "驯兽"
                  },
                  {
                    "id": "arcana",
                    "name": "奥秘"
                  },
                  {
                    "id": "athletics",
                    "name": "运动"
                  },
                  {
                    "id": "deception",
                    "name": "欺瞒"
                  },
                  {
                    "id": "history",
                    "name": "历史"
                  },
                  {
                    "id": "insight",
                    "name": "洞悉"
                  },
                  {
                    "id": "intimidation",
                    "name": "威吓"
                  },
                  {
                    "id": "investigation",
                    "name": "调查"
                  },
                  {
                    "id": "medicine",
                    "name": "医药"
                  },
                  {
                    "id": "nature",
                    "name": "自然"
                  },
                  {
                    "id": "perception",
                    "name": "察觉"
                  },
                  {
                    "id": "performance",
                    "name": "表演"
                  },
                  {
                    "id": "persuasion",
                    "name": "说服"
                  },
                  {
                    "id": "religion",
                    "name": "宗教"
                  },
                  {
                    "id": "sleightOfHand",
                    "name": "巧手"
                  },
                  {
                    "id": "stealth",
                    "name": "隐匿"
                  },
                  {
                    "id": "survival",
                    "name": "生存"
                  }
                ]
              }
            ]
          },
          {
            "name": "语出惊人",
            "description": "你学会如何运用你的机智去干扰、迷惑、并瓦解他人的信心和能力。当一个距离你60尺内且你所能看见的生物进行一次攻击检定、属性检定、或伤害骰时，你可以使用你的反应并消耗一次你吟游激励的使用次数，骰一颗吟游激励骰，并将骰出来的数字减掉该生物的掷骰结果。",
            "level": 3
          },
          {
            "name": "额外魔法秘密",
            "description": "你从任意职业中额外习得二个法术。所选的法术对你而言被视作吟游诗人法术，但不会被计入你已知吟游诗人法术的数量中。",
            "level": 6,
            "choices": [
              {
                "id": "lore-bard-magical-secrets",
                "name": "额外魔法秘密：选择二个法术",
                "chooseNumber": 2,
                "dynamic": "custom-spells"
              }
            ]
          },
          {
            "name": "绝代技能",
            "description": "当你进行一次属性检定时，你可以消耗一次你吟游激励的使用次数。骰一颗吟游激励骰，并将骰出来的数字加入该属性检定的掷骰结果中。你可以选择在你为该属性检定掷骰后，但DM宣布你成功与否之前使用此能力。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "valor",
        "name": "勇气学院",
        "description": "勇气学院的吟游诗人是一群勇敢的歌者，他们的诗歌让关于过去伟大英雄们的记忆仍然永存世间，并因此激励新世代的英雄们。",
        "traits": [
          {
            "name": "额外熟练",
            "description": "你获得中甲、盾牌、和军用武器的熟练。",
            "level": 3
          },
          {
            "name": "战斗激励",
            "description": "你学会在战斗中激励他人。一个拥有你所给予的吟游激励骰的生物，可以骰该吟游激励骰以将骰出来的数字加入它刚进行的武器伤害骰中。或者，当一个以该生物为目标的攻击检定被进行时，它可以在看见该次攻击检定的结果后，但DM宣布该次攻击命中与否之前，使用它的反应以骰该吟游激励骰，并将骰出来的数字加入它对该次攻击的AC中。",
            "level": 3
          },
          {
            "name": "额外攻击",
            "description": "每当你在自己回合执行攻击动作时，你可以发动两次攻击，而非一次。",
            "level": 6
          },
          {
            "name": "战斗魔法",
            "description": "你已经精通于将施法和使用武器编织成一个协调的行动。当你使用你的动作施放一个吟游诗人法术时，你能够以一个附赠动作进行一次武器攻击。",
            "level": 14
          }
        ],
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "CHA",
          "min": 13
        }
      ],
      "proficiencies": {
        "armor": [
          "轻甲"
        ],
        "tools": [
          "三种你所选择乐器"
        ],
        "skills": {
          "count": 1,
          "choices": [
            "任意技能"
          ]
        }
      }
    }
  },
  {
    "id": "cleric",
    "name": "牧师",
    "description": "身兼信徒神力管道的祭司与施法者。他们使用神圣力量来治愈伤痛、鼓舞盟友，并唤起诸神之怒打击罪恶或不死生物。身披铠甲的他们同样也能是在前线捍卫信仰的战斗核心。",
    "hitDie": 8,
    "primaryAbility": [
      "WIS"
    ],
    "saves": [
      "WIS",
      "CHA"
    ],
    "armorProficiencies": [
      "轻甲",
      "中甲",
      "盾牌"
    ],
    "weaponProficiencies": [
      "简易武器"
    ],
    "toolProficiencies": [],
    "skills": {
      "count": 2,
      "choices": [
        "历史",
        "洞悉",
        "医疗",
        "说服",
        "宗教"
      ]
    },
    "startingEquipment": [
      "(a)一把硬头锤 或 (b)一把战锤(若熟练)",
      "(a)一件鳞甲, (b)一件皮甲, 或 (c)一件锁子甲(若熟练)",
      "(a)一把轻弩和20支弩矢 或 (b)任意一把简易武器",
      "(a)一套祭司套装 或 (b)一套探索者套装",
      "一面盾牌和一个圣徽"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "cleric-skills",
            "name": "选择 2 个技能熟练",
            "chooseNumber": 2,
            "options": [
              {
                "id": "history",
                "name": "历史"
              },
              {
                "id": "insight",
                "name": "洞悉"
              },
              {
                "id": "medicine",
                "name": "医疗"
              },
              {
                "id": "persuasion",
                "name": "说服"
              },
              {
                "id": "religion",
                "name": "宗教"
              }
            ]
          },
          {
            "id": "cleric-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把硬头锤"
              },
              {
                "id": "opt-1",
                "name": "(b)一把战锤(若熟练)"
              }
            ]
          },
          {
            "id": "cleric-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一件鳞甲"
              },
              {
                "id": "opt-1",
                "name": "(b)一件皮甲"
              },
              {
                "id": "opt-2",
                "name": "(c)一件锁子甲(若熟练)"
              }
            ]
          },
          {
            "id": "cleric-equip-2",
            "name": "装备组 3 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把轻弩和20支弩矢"
              },
              {
                "id": "opt-1",
                "name": "(b)任意一把简易武器"
              }
            ]
          },
          {
            "id": "cleric-equip-3",
            "name": "装备组 4 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一套祭司套装"
              },
              {
                "id": "opt-1",
                "name": "(b)一套探索者套装"
              }
            ]
          },
          {
            "id": "cleric-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "施法",
        "description": "作为神性力量的通道，你可以施放牧师法术。戏法：在1级时，你知晓三个从牧师法术列表自选的戏法。\n\n准备及施放法术\n牧师表中显示了你有多少个法术位可以用来施放你一环或更高环的牧师法术。要施放其中一个这些法术，你必须消耗一个与该法术环阶相同或更高的法术位。你在完成一次长休后恢复所有你花费掉的法术位。\n\n你准备一份你所能施放的牧师法术列表，从牧师法术列表中选择。当你这么做时，选择数量等同于你感知调整值 + 你牧师等级的牧师法术（最少一个法术）。这些法术的环阶都必须符合你所拥有法术位的环阶。\n\n举例来说，如果你是一个3级的牧师，你拥有四个1环和二个2环的法术位。你的感知为16，则你已准备法术的列表中可以包含总共六个1环或2环的法术。若你准备了1环法术治疗伤势，你可以使用1环和2环的法术位来施放它。施放法术并不会将它从你的准备法术列表中移除。\n\n你可以在你完成一次长休时改变你的准备法术列表。准备一份新的牧师法术列表需要花费时间于祈祷和冥想：你需要为你列表上每个法术的每个环阶都花费至少1分钟的时间。\n\n施法属性\n感知是你施展牧师法术的施法属性。你法术的力量来自于你对于你信仰的奉献。每当一个牧师法术提及你的施法属性时，你将使用你的感知。此外，当决定你牧师法术的豁免DC、以及使用牧师法术进行攻击检定时，你使用你的感知调整值。\n\n法术豁免DC = 8 + 你的熟练加值 + 你的感知 调整值\n法术攻击调整值 = 你的熟练加值 + 你的感知 调整值\n\n仪式施法\n若一个牧师法术具有仪式标签，且你已准备了该法术，则你可以将它作为仪式法术施放。\n\n施法法器\n你可以使用一个圣徽（第五章），来作为你施放牧师法术的法器。",
        "level": 1
      },
      {
        "name": "神圣领域",
        "description": "从可用领域列表中选择一个你所信仰神祇的关联领域。每个领域在1级时赋予你领域法术以及其他能力。它也将在2级时赋予你另一种使用引导神力能力的方式，并在6级、8级、和17级时赋予你其他额外好处。",
        "level": 1
      },
      {
        "name": "引导神力 (1/休息)",
        "description": "在2级时，你获得引导直接来自你神祇的神圣能量，并用其能量驱动魔法效果的能力。你起始拥有二个这种效果：驱散不死，以及一个由你神圣领域决定的效果。当你使用你的引导神力时，你选择要创造出哪一个效果。你接着必须完成一次短休或长休后才能再使用你的引导神力。从6级开始，你可以在休息之间使用引导神力二次。且从18级开始，你可以在休息之间使用引导神力三次。",
        "level": 2
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至4级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 4,
        "choices": [
          {
            "id": "cleric-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "摧毁不死 (CR 1/2)",
        "description": "从5级开始，当一个挑战等级为1/2或更低的不死生物在对抗你驱散不死能力的豁免检定中失败，该生物将立即被摧毁。",
        "level": 5
      },
      {
        "name": "引导神力 (2/休息)",
        "description": "从6级开始，你可以在休息之间使用引导神力二次。",
        "level": 6
      },
      {
        "name": "神圣领域能力",
        "description": "在6级时，你获得一个由你神圣领域所赋予的能力。",
        "level": 6
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至8级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 8,
        "choices": [
          {
            "id": "cleric-asi-8",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "摧毁不死 (CR 1)",
        "description": "从8级开始，当一个挑战等级为1或更低的不死生物在对抗你驱散不死能力的豁免检定中失败，该生物将立即被摧毁。",
        "level": 8
      },
      {
        "name": "神圣领域能力",
        "description": "在8级时，你获得一个由你神圣领域所赋予的能力。",
        "level": 8
      },
      {
        "name": "神力干预",
        "description": "从10级开始，你可以在你迫切需要的时候呼求你的神祇为你插手介入。恳求你神祇的帮助需要你使用你的动作。描述你所寻求的协助，并骰一颗百面骰。若你骰出的数字等于或低于你的牧师等级，则你的神祇将出手干预。由DM决定这次干预的性质。若你的神祇出手干预，则你在7天内都不能再使用此能力。否则你可以在你完成一次长休后再次使用它。在20级时，你呼求干预的动作将自动成功，不再需要掷骰。",
        "level": 10
      },
      {
        "name": "摧毁不死 (CR 2)",
        "description": "从11级开始，当一个挑战等级为2或更低的不死生物在对抗你驱散不死能力的豁免检定中失败，该生物将立即被摧毁。",
        "level": 11
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至12级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 12,
        "choices": [
          {
            "id": "cleric-asi-12",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "摧毁不死 (CR 3)",
        "description": "从14级开始，当一个挑战等级为3或更低的不死生物在对抗你驱散不死能力的豁免检定中失败，该生物将立即被摧毁。",
        "level": 14
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至16级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 16,
        "choices": [
          {
            "id": "cleric-asi-16",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "摧毁不死 (CR 4)",
        "description": "从17级开始，当一个挑战等级为4或更低的不死生物在对抗你驱散不死能力的豁免检定中失败，该生物将立即被摧毁。",
        "level": 17
      },
      {
        "name": "神圣领域能力",
        "description": "在17级时，你获得一个由你神圣领域所赋予的能力。",
        "level": 17
      },
      {
        "name": "引导神力 (3/休息)",
        "description": "从18级开始，你可以在休息之间使用引导神力三次。",
        "level": 18
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至19级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 19,
        "choices": [
          {
            "id": "cleric-asi-19",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "神力干预强化",
        "description": "在20级时，你呼求干预的动作将自动成功，不再需要掷骰。",
        "level": 20
      }
    ],
    "spellcasting": {
      "type": "prepared",
      "ability": "WIS",
      "cantripsKnown": [
        3,
        3,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        5,
        5,
        5,
        5,
        5,
        5,
        5,
        5,
        5,
        5,
        5
      ],
      "spellSlots": [
        [
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          3,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          2,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          1,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          2,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          1,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          1,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          2,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          2,
          2,
          1,
          1
        ]
      ],
      "spellList": "cleric"
    },
    "subclassAvailableAtLevel": 1,
    "subclasses": [
      {
        "id": "life",
        "name": "生命领域",
        "description": "生命领域专注于澎湃的正能量，旨在维持生命的延续与繁衍。该领域的神圣力量执掌医疗与康复，能驱散疫病、抚平创伤并净化亡灵。几乎所有非邪恶的神祇都拥有此领域。",
        "traits": [
          {
            "name": "额外熟练",
            "description": "你获得重甲的熟练。",
            "level": 1
          },
          {
            "name": "生命门徒",
            "description": "你的治疗法术变得更加有效。每当你使用一个1环或更高环的法术以回复一个生物的生命值时，该生物额外回复等同于2 + 该法术环阶的生命值。",
            "level": 1
          },
          {
            "name": "引导神力：维系生命",
            "description": "你可以使用你的引导神力以治疗严重的伤势。以一个动作，你展现你的圣徽并唤起可以回复等同于你牧师等级五倍生命值的治疗能量。选择任何距离你30尺内的生物，并将这些生命值分配给它们回复。这个能力无法让一个生物回复到超过它生命值最大值的一半。你不能对不死生物或构装体使用此能力。",
            "level": 2
          },
          {
            "name": "祝圣医者",
            "description": "你施放于他人的治疗法术也将治疗你自己。当你施放一个1环或更高环的法术以回复除了你以外一个生物的生命值时，你将回复等同于2 + 该法术环阶的生命值。",
            "level": 6
          },
          {
            "name": "神圣打击",
            "description": "你获得将神圣能量注入你武器打击的能力。在你的每个回合一次，当你使用一次武器攻击命中一个生物时，你可以使该攻击对目标造成额外的1d8光耀伤害。当你升至14级时，这个额外伤害增加至2d8。",
            "level": 8
          },
          {
            "name": "极效治疗",
            "description": "当你需要骰一颗或以上的骰子以决定使用法术回复的生命值时，你改为使用每颗骰子的最大值。举例来说，当你要回复一个生物2d6点生命值时，你改为直接回复它12点生命值。",
            "level": 17
          }
        ],
        "spells": [
          {
            "level": 1,
            "spellId": "bless",
            "alwaysPrepared": true
          },
          {
            "level": 1,
            "spellId": "cure-wounds",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "lesser-restoration",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "spiritual-weapon",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "beacon-of-hope",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "revivify",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "death-ward",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "guardian-of-faith",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "mass-cure-wounds",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "raise-dead",
            "alwaysPrepared": true
          }
        ],
        "source": "phb"
      },
      {
        "id": "tempest",
        "name": "暴风领域",
        "description": "暴风领域神祇统御着狂风、骤雨与雷霆等自然伟力。牧师获得操控风暴、闪电的超凡能量，可在异教徒心中唤起对神明敬畏，或在尘世平息大自然的暴怒。",
        "traits": [
          {
            "name": "额外熟练",
            "description": "你获得军用武器和重甲的熟练。",
            "level": 1
          },
          {
            "name": "风暴狂怒",
            "description": "你可以如雷鸣般斥退攻击者。当一个距离你5尺内且你能看见的生物以一次攻击命中你，你可以使用你的反应使该生物进行一次敏捷豁免。该生物若豁免失败将受到2d8闪电或雷鸣伤害（由你选择），豁免成功则只受到一半的伤害。你可以使用这个能力的次数等同于你的感知调整值（最少一次）。你在完成一次长休后恢复所有你花费掉的次数。",
            "level": 1
          },
          {
            "name": "引导神力：毁灭狂怒",
            "description": "你可以使用你的引导神力以施加不受控的凶猛暴风之力。当你掷骰决定闪电或雷鸣伤害时，你可以使用你的引导神力，不掷骰而改为直接造成最大伤害。",
            "level": 2
          },
          {
            "name": "雷电猛击",
            "description": "当你对一个体型为大型或更小的生物造成闪电伤害时，你也可以将它推离你最多10尺距离。",
            "level": 6
          },
          {
            "name": "神圣打击",
            "description": "你获得将神圣能量注入你武器打击的能力。在你的每个回合一次，当你使用一次武器攻击命中一个生物时，你可以使该攻击对目标造成额外的1d8雷鸣伤害。当你升至14级时，这个额外伤害增加至2d8。",
            "level": 8
          },
          {
            "name": "风暴之子",
            "description": "每当你不在地下或室内时，你获得等同于你当下步行速度的飞行速度。",
            "level": 17
          }
        ],
        "spells": [
          {
            "level": 1,
            "spellId": "fog-cloud",
            "alwaysPrepared": true
          },
          {
            "level": 1,
            "spellId": "thunderwave",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "gust-of-wind",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "shatter",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "call-lightning",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "sleet-storm",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "control-water",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "ice-storm",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "destructive-wave",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "insect-plague",
            "alwaysPrepared": true
          }
        ],
        "source": "phb"
      },
      {
        "id": "light",
        "name": "光明领域",
        "description": "光明之神提倡重生和更新、真实、警醒、和美的理想，且经常使用太阳作为徽记。光明之神的牧师有着被启蒙的灵魂，被他们神明的光辉和洞察力给充满，负责驱赶谎言并燃尽黑暗。",
        "traits": [
          {
            "name": "额外戏法",
            "description": "若你尚未习得光亮术戏法，则你习得之。",
            "level": 1,
            "choices": [
              {
                "id": "light-domain-cantrip",
                "name": "光亮术",
                "chooseNumber": 1,
                "dynamic": "spell",
                "spellType": "cantrip",
                "spellList": "cleric",
                "preselected": [
                  "light"
                ]
              }
            ]
          },
          {
            "name": "闪耀防护",
            "description": "你可以使神圣光芒介入你与进行攻击的敌人之间。当你被一个距离你30尺内且你能看见的生物攻击时，你可以在它命中或失手之前使用你的反应让强光在攻击者面前闪耀，以使该次攻击检定承受劣势。一个不会陷入目盲状态的攻击者将免疫于此能力。你可以使用这个能力的次数等同于你的感知调整值（最少一次）。你在完成一次长休后恢复所有你花费掉的次数。",
            "level": 1
          },
          {
            "name": "引导神力：黎明曙光",
            "description": "以一个动作，你展现你的圣徽，且任何距离你30尺内的魔法黑暗将被解消。此外，每个距离你30尺内的敌对生物必须进行一次体质豁免。豁免失败的生物将受到等同于2d10 + 你的牧师等级的光耀伤害，豁免成功则只受到一半的伤害。一个对你有全掩蔽的生物不会受到影响。",
            "level": 2
          },
          {
            "name": "强化闪耀",
            "description": "你也可以在一个距离你30尺内且你能看见的生物攻击除了你以外的目标时使用你的闪耀防护能力。",
            "level": 6
          },
          {
            "name": "强力施法",
            "description": "你将你的感知调整值加入任何你使用牧师戏法所造成的伤害中。",
            "level": 8
          },
          {
            "name": "日冕光辉",
            "description": "你可以使用你的动作以启动一道太阳灵光，持续1分钟或直到你使用一个动作解消它。你将散发出60尺半径的明亮光照和再延伸30尺的微光光照。你的敌人若处于此明亮光照内，则它在对抗任何法术所造成的火焰或光耀伤害时所进行的豁免检定中具有劣势。",
            "level": 17
          }
        ],
        "spells": [
          {
            "level": 1,
            "spellId": "burning-hands",
            "alwaysPrepared": true
          },
          {
            "level": 1,
            "spellId": "faerie-fire",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "flaming-sphere",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "scorching-ray",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "daylight",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "fireball",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "guardian-of-faith",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "wall-of-fire",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "flame-strike",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "scrying",
            "alwaysPrepared": true
          }
        ],
        "source": "phb"
      },
      {
        "id": "trickery",
        "name": "诡术领域",
        "description": "诡术之神都是恶作剧高手，也是不断挑战凡人和神明共有秩序的煽动者。祂们是窃贼、恶棍、赌徒、叛乱者、和解放者的守护神。祂们的牧师是颠覆世界的力量，他们偏好花言巧语、恶作剧、欺瞒、和窃盗更胜于正面对抗。",
        "traits": [
          {
            "name": "诡术祝福",
            "description": "你可以使用你的动作触碰一个除了你以外的自愿生物，让它在敏捷（隐匿）检定中获得优势。这个祝福会持续1小时或直到你再次使用此能力。",
            "level": 1
          },
          {
            "name": "引导神力：召唤假体",
            "description": "以一个动作，你创造一个你自己的完美幻象，持续1分钟，或直到你失去你的专注（就如同你专注于法术一样）。这个幻象会出现在一个距离你30尺内你所能看见的未被占据空间。在你的回合以一个附赠动作，你可以使幻象移动最多30尺到一处你所能看见的空间，但它必须维持在距离你120尺内的位置。在持续期间，你可以如同你处于幻象的位置来施放法术，且如果目标距离你或幻象5尺以内，攻击检定将具有优势。",
            "level": 2
          },
          {
            "name": "引导神力：阴影斗篷",
            "description": "以一个动作，你将变得隐形直到你的下个回合结束。若你攻击或施放法术，你将变得可见。",
            "level": 6
          },
          {
            "name": "神圣打击",
            "description": "你获得将毒素—一个来自你神祇的赠礼—注入你武器打击的能力。在你的每个回合一次，当你使用一次武器攻击命中一个生物时，你可以使该攻击对目标造成额外的1d8毒素伤害。当你升至14级时，这个额外伤害增加至2d8。",
            "level": 8
          },
          {
            "name": "强化假体",
            "description": "当你使用召唤假体时，你可以创造出最多四个你自己的幻象假体，而非一个。在你的回合以一个附赠动作，你可以让任意数量的假体移动最多30尺距离，到最远120尺的范围内。",
            "level": 17
          }
        ],
        "spells": [
          {
            "level": 1,
            "spellId": "charm-person",
            "alwaysPrepared": true
          },
          {
            "level": 1,
            "spellId": "disguise-self",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "mirror-image",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "pass-without-trace",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "blink",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "dispel-magic",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "dimension-door",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "polymorph",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "dominate-person",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "modify-memory",
            "alwaysPrepared": true
          }
        ],
        "source": "phb"
      },
      {
        "id": "death",
        "name": "死亡领域",
        "description": "死亡领域掌控使生灵陨落的原动力与死灵负能量。该领域神祇执掌着谋杀、痛苦、疫病及冥界之权，是死灵法师、巫妖和吸血鬼等不死存在的终极守护者。",
        "traits": [
          {
            "name": "额外熟练",
            "description": "该牧师获得军用武器熟练项。",
            "level": 1
          },
          {
            "name": "收割者",
            "description": "该牧师可以从任意法术列表中选择学习一个死灵戏法。该牧师施展一个通常指定一个生物为目标的死灵戏法时，则该法术现在可以指定施法距离内两个相互之间距离不超过5尺的生物。",
            "level": 1,
            "choices": [
              {
                "id": "death-domain-cantrip",
                "name": "选择一个死灵戏法",
                "chooseNumber": 1,
                "dynamic": "spell",
                "spellType": "cantrip"
              }
            ]
          },
          {
            "name": "引导神力：死亡之触",
            "description": "该牧师以近战攻击命中一个生物时，可以使用引导神力对该目标造成额外的黯蚀伤害。该伤害值等于 5 + 其牧师等级两倍的数值。",
            "level": 2
          },
          {
            "name": "命定毁伤",
            "description": "该牧师引导负能量的能力更为有效。该角色的牧师法术与引导神力选项所造成的黯蚀伤害将无视对黯蚀伤害抗性。",
            "level": 6
          },
          {
            "name": "神圣打击",
            "description": "该牧师可以使其武器打击充满负能量。该牧师在每个其自己回合里有一次机会，可以在用武器攻击命中某生物时额外造成1d8的黯蚀伤害。第14级时，该伤害提升到 2d8。",
            "level": 8
          },
          {
            "name": "精通收割者",
            "description": "该牧师施展一个1至5环的死灵法术时，若该法术只指定一个生物为目标，则将其改为指定施法距离内相互之间距离不超过5尺的两个生物。如果该法术消耗其材料构材，则该牧师必须为每个目标提供一份耗材。",
            "level": 17
          }
        ],
        "spells": [
          {
            "level": 1,
            "spellId": "false-life",
            "alwaysPrepared": true
          },
          {
            "level": 1,
            "spellId": "ray-of-sickness",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "blindness-deafness",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "ray-of-enfeeblement",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "animate-dead",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "vampiric-touch",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "blight",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "death-ward",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "antilife-shell",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "cloudkill",
            "alwaysPrepared": true
          }
        ],
        "source": "dmg"
      },
      {
        "id": "war",
        "name": "战争领域",
        "description": "战争有很多表现形式。不论如何，战争之神都守望着战士们，按他们的功绩行赏。这些神的牧师善于战斗、激励他人在战斗中打一场好仗、或献上暴力行为作为祈祷。",
        "traits": [
          {
            "name": "额外熟练",
            "description": "你获得军用武器和重甲的熟练。",
            "level": 1
          },
          {
            "name": "战争祭司",
            "description": "你的神在你投身于战斗时赋予你激励。当你执行攻击动作时，你能够以一个附赠动作进行一次武器攻击。你可以使用此能力等同于你感知调整值的次数（最少一次）。你在完成一次长休后恢复所有你花费掉的次数。",
            "level": 1
          },
          {
            "name": "引导神力：神导打击",
            "description": "你可以使用你的引导神力以不可思议的准确度猛击。当你进行一次攻击检定时，你可以使用你的引导神力以在该检定中获得+10的加值。你在看见掷骰结果之后，但DM说出攻击是否命中之前决定是否使用此能力。",
            "level": 2
          },
          {
            "name": "引导神力：战神祝福",
            "description": "当一个距离你30尺内的生物进行一次攻击检定，你可以使用你的反应以使用你的引导神力，赋予该生物在该攻击检定中+10的加值。你在看见掷骰结果之后，但DM说出攻击是否命中之前决定是否使用此能力。",
            "level": 6
          },
          {
            "name": "神圣打击",
            "description": "你获得将神圣能量注入你武器打击的能力。在你的每个回合一次，当你使用一次武器攻击命中一个生物时，你可以使该攻击对目标造成额外的1d8光耀伤害。当你升至14级时，这个额外伤害增加至2d8。",
            "level": 8
          },
          {
            "name": "战斗化身",
            "description": "你获得对来自非魔法武器所造成的钝击、穿刺、和挥砍伤害的抗性。",
            "level": 17
          }
        ],
        "spells": [
          {
            "level": 1,
            "spellId": "divine-favor",
            "alwaysPrepared": true
          },
          {
            "level": 1,
            "spellId": "shield-of-faith",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "magic-weapon",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "spiritual-weapon",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "crusaders-mantle",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "spirit-guardians",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "freedom-of-movement",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "stoneskin",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "flame-strike",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "hold-monster",
            "alwaysPrepared": true
          }
        ],
        "source": "phb"
      },
      {
        "id": "knowledge",
        "name": "知识领域",
        "description": "知识之神重视学习和理解胜过一切。有些神祇则将知识密藏起来，不让其他人所知。而有些则承诺祂们的追随者，若他们能解开多元宇宙中的秘密，就将获得无比的权力。",
        "traits": [
          {
            "name": "知识祝福",
            "description": "你学会二种自选的语言。你也变得熟练于二个从下列选项中自选的技能：奥秘、历史、自然或宗教。你的熟练加值在使用这些技能所进行的任何属性检定中变为两倍。",
            "level": 1,
            "choices": [
              {
                "id": "knowledge-domain-skills",
                "name": "选择两个技能",
                "chooseNumber": 2,
                "dynamic": "expertise",
                "options": [
                  {
                    "id": "arcana",
                    "name": "奥秘",
                    "description": "智力"
                  },
                  {
                    "id": "history",
                    "name": "历史",
                    "description": "智力"
                  },
                  {
                    "id": "nature",
                    "name": "自然",
                    "description": "智力"
                  },
                  {
                    "id": "religion",
                    "name": "宗教",
                    "description": "智力"
                  }
                ]
              }
            ]
          },
          {
            "name": "引导神力：岁月知识",
            "description": "以一个动作，你选择一项技能或工具。在10分钟内，你将熟练于所选的技能或工具。",
            "level": 2
          },
          {
            "name": "引导神力：阅读思想",
            "description": "你可以阅读一个生物的思想。你可以接着利用你对该生物的心灵通道以命令它。选择距离你60尺内且你所能看见的生物。该生物必须进行一次感知豁免。若该生物豁免失败，你可以在它距离你60尺内时读取它的表层思想，并用动作对该生物施放暗示术法术而无需消耗法术位。目标将在对抗此法术的豁免检定中自动失败。",
            "level": 6
          },
          {
            "name": "强力施法",
            "description": "你将你的感知调整值加入任何你使用牧师戏法所造成的伤害中。",
            "level": 8
          },
          {
            "name": "过去之景",
            "description": "你可以呼唤出与你所持握的一个物体或你当下环境有关的过去景象。你花费至少1分钟的时间冥想与祈祷，然后接收到有如梦境般，近期事件的朦胧一瞥。",
            "level": 17
          }
        ],
        "spells": [
          {
            "level": 1,
            "spellId": "command",
            "alwaysPrepared": true
          },
          {
            "level": 1,
            "spellId": "identify",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "augury",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "suggestion",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "nondetection",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "speak-with-dead",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "arcane-eye",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "confusion",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "legend-lore",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "scrying",
            "alwaysPrepared": true
          }
        ],
        "source": "phb"
      },
      {
        "id": "nature",
        "name": "自然领域",
        "description": "自然之神就如同自然界本身一样变化多端。这些勇士会在增进特定自然之神的利益上扮演更加积极的角色。这些牧师可能会前去狩猎破坏林地的邪恶怪物、祝福忠实信徒们的收获。",
        "traits": [
          {
            "name": "自然侍祭",
            "description": "你学会一个自选的德鲁伊戏法。你同时选择并获得下列其中一个技能的熟练：驯兽、自然或生存。",
            "level": 1,
            "choices": [
              {
                "id": "nature-domain-cantrip",
                "name": "选择一个德鲁伊戏法",
                "chooseNumber": 1,
                "dynamic": "spell",
                "spellType": "cantrip",
                "spellList": "druid"
              },
              {
                "id": "nature-domain-skill",
                "name": "选择一个技能熟练项",
                "chooseNumber": 1,
                "options": [
                  {
                    "id": "animalHandling",
                    "name": "驯兽",
                    "description": "感知"
                  },
                  {
                    "id": "nature",
                    "name": "自然",
                    "description": "智力"
                  },
                  {
                    "id": "survival",
                    "name": "生存",
                    "description": "感知"
                  }
                ]
              }
            ]
          },
          {
            "name": "额外熟练",
            "description": "你获得重甲的熟练。",
            "level": 1
          },
          {
            "name": "引导神力：魅惑动植物",
            "description": "以一个动作，你展现你的圣徽并呼唤你神明的名讳。每个距离你30尺内且能看见你的野兽和植物生物必须进行一次感知豁免。若该生物豁免失败，则它将被你魅惑持续1分钟或直到受到伤害。",
            "level": 2
          },
          {
            "name": "抑制元素",
            "description": "当你或一个距离你30尺内的生物受到强酸、冷冻、火焰、闪电、或雷鸣伤害时，你可以使用你的反应以让该生物在那瞬间获得对该伤害的抗性。",
            "level": 6
          },
          {
            "name": "神圣打击",
            "description": "你获得将神圣能量注入你武器打击的能力。在你的每个回合一次，当你使用一次武器攻击命中一个生物时，你可以使该攻击对目标造成额外的1d8点冷冻、火焰、或闪电伤害（由你选择）。当你升至14级时，这个额外伤害增加至2d8。",
            "level": 8
          },
          {
            "name": "自然之主",
            "description": "你获得命令动物和植物生物的能力。当一个生物被你通过魅惑动植物能力给魅惑时，你可以在你的回合采取一个附赠动作，以口头命令每个这些生物在它们各自的下个回合中将要做什么。",
            "level": 17
          }
        ],
        "spells": [
          {
            "level": 1,
            "spellId": "animal-friendship",
            "alwaysPrepared": true
          },
          {
            "level": 1,
            "spellId": "speak-with-animals",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "barkskin",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "spike-growth",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "plant-growth",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "wind-wall",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "dominate-beast",
            "alwaysPrepared": true
          },
          {
            "level": 7,
            "spellId": "grasping-vine",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "insect-plague",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "tree-stride",
            "alwaysPrepared": true
          }
        ],
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "WIS",
          "min": 13
        }
      ],
      "proficiencies": {
        "armor": [
          "轻甲",
          "中甲",
          "盾牌"
        ]
      }
    }
  },
  {
    "id": "druid",
    "name": "德鲁伊",
    "description": "信奉远古宗教，依靠大自然、月光星辰或元素施法的自然祭司。他们能变化形态为各类野兽（如凶猛的狼、熊），将自然怒火化作元素法术打击敌人，或者利用自然之魔力治愈伤患。",
    "hitDie": 8,
    "primaryAbility": [
      "WIS"
    ],
    "saves": [
      "WIS",
      "INT"
    ],
    "armorProficiencies": [
      "轻甲",
      "中甲",
      "盾牌（德鲁伊不能穿戴或使用金属制成的护甲和盾牌）"
    ],
    "weaponProficiencies": [
      "棍棒",
      "匕首",
      "飞镖",
      "标枪",
      "硬头锤",
      "长棍",
      "弯刀",
      "镰刀",
      "投石索",
      "矛"
    ],
    "toolProficiencies": [
      "草药工具"
    ],
    "skills": {
      "count": 2,
      "choices": [
        "奥秘",
        "驯兽",
        "洞悉",
        "医疗",
        "自然",
        "察觉",
        "宗教",
        "生存"
      ]
    },
    "startingEquipment": [
      "(a)一个木制盾牌 或 (b)任意一把简易武器",
      "(a)一把弯刀 或 (b)任意一把简易近战武器",
      "一件皮甲、一套探索者套装、和一个德鲁伊法器"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "druid-skills",
            "name": "选择 2 个技能熟练",
            "chooseNumber": 2,
            "options": [
              {
                "id": "arcana",
                "name": "奥秘"
              },
              {
                "id": "animalHandling",
                "name": "驯兽"
              },
              {
                "id": "insight",
                "name": "洞悉"
              },
              {
                "id": "medicine",
                "name": "医疗"
              },
              {
                "id": "nature",
                "name": "自然"
              },
              {
                "id": "perception",
                "name": "察觉"
              },
              {
                "id": "religion",
                "name": "宗教"
              },
              {
                "id": "survival",
                "name": "生存"
              }
            ]
          },
          {
            "id": "druid-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一个木制盾牌"
              },
              {
                "id": "opt-1",
                "name": "(b)任意一把简易武器"
              }
            ]
          },
          {
            "id": "druid-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把弯刀"
              },
              {
                "id": "opt-1",
                "name": "(b)任意一把简易近战武器"
              }
            ]
          },
          {
            "id": "druid-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "德鲁伊语",
        "description": "你知晓德鲁伊语，一种属于德鲁伊的秘密语言。你可以说这种语言，并用它来留下隐藏的信息。你和其他知晓这种语言的人将会自动注意到这类信息。其他人则可以通过成功通过一次DC 15的感知（察觉）检定以察觉这个信息的存在，但不使用魔法就无法解读它。",
        "level": 1
      },
      {
        "name": "施法",
        "description": "借助大自然本身的天授精粹，你可以施放法术。戏法：在1级时，你知晓两个从德鲁伊法术列表自选的戏法。\n\n准备及施放法术\n德鲁伊表中显示了你有多少个法术位可以用来施放你一环或更高环的德鲁伊法术。要施放其中一个这些德鲁伊法术，你必须消耗一个与该法术环阶相同或更高的法术位。你在完成一次长休后恢复所有你花费掉的法术位。\n\n你准备一份你所能施放的德鲁伊法术列表，从德鲁伊法术列表中选择。当你这么做时，选择数量等同于你感知调整值 + 你德鲁伊等级的德鲁伊法术（最少一个法术）。这些法术的环阶都必须符合你所拥有法术位的环阶。\n\n举例来说，如果你是一个3级的德鲁伊，你拥有四个1环和二个2环的法术位。你的感知为16，则你已准备法术的列表中可以包含总共六个1环或2环的法术。若你准备了1环法术治疗伤势，你可以使用1环和2环的法术位来施放它。施放法术并不会将它从你的准备法术列表中移除。\n\n你也可以在你完成一次长休时改变你的准备法术列表。准备一份新的德鲁伊法术列表需要花费时间于祈祷和冥想：你需要为你列表上每个法术的每个环阶都花费至少1分钟的时间。\n\n施法属性\n由于你的魔法是源自你对大自然的奉献与协调，感知是你施展德鲁伊法术的施法属性。每当法术提及你的施法属性时，你将使用你的感知。此外，当决定你德鲁伊法术的豁免DC、以及使用德鲁伊法术进行攻击检定时，你使用你的感知调整值。\n\n法术豁免DC = 8 + 你的熟练加值 + 你的感知 调整值\n法术攻击调整值 = 你的熟练加值 + 你的感知 调整值\n\n仪式施法\n若一个德鲁伊法术具有仪式标签，且你已准备了该法术，则你可以将它作为仪式法术施放。",
        "level": 1
      },
      {
        "name": "德鲁伊结社",
        "description": "在2级时，你从可选结社列表中选择并参与一个德鲁伊结社。你的选择将在2级、6级、10级、和14级时赋予你新的能力。",
        "level": 2
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至4级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 4,
        "choices": [
          {
            "id": "druid-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "荒野形态强化",
        "description": "在4级时，你的荒野形态获得强化，可以变为具有游泳速度的野兽（CR 1/2）。8级时可变为飞行野兽（CR 1）。",
        "level": 4
      },
      {
        "name": "德鲁伊结社能力",
        "description": "在6级时，你获得一个由你德鲁伊结社所赋予的能力。",
        "level": 6
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至8级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 8,
        "choices": [
          {
            "id": "druid-asi-8",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "德鲁伊结社能力",
        "description": "在10级时，你获得一个由你德鲁伊结社所赋予的能力。",
        "level": 10
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至12级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 12,
        "choices": [
          {
            "id": "druid-asi-12",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "德鲁伊结社能力",
        "description": "在14级时，你获得一个由你德鲁伊结社所赋予的能力。",
        "level": 14
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至16级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 16,
        "choices": [
          {
            "id": "druid-asi-16",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "不老身躯",
        "description": "从18级开始，你使用的原初魔法让你老化的更加缓慢。每10年过去，你的身体只会老化1年。",
        "level": 18
      },
      {
        "name": "野兽施法",
        "description": "从18级开始，你可以在处于荒野形态所变成的任何型态时施放你的许多德鲁伊法术。你可以在处于野兽型态时运行德鲁伊法术的姿势和声音构材，但你无法提供材料构材。",
        "level": 18
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至19级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 19,
        "choices": [
          {
            "id": "druid-asi-19",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "大德鲁伊",
        "description": "在20级时，你可以无限次的使用你的荒野形态。此外，你可以忽略你德鲁伊法术的姿势和声音构材、以及任何没有价值且不会被法术消耗的材料构材。",
        "level": 20
      }
    ],
    "spellcasting": {
      "type": "prepared",
      "ability": "WIS",
      "cantripsKnown": [
        2,
        2,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      "spellSlots": [
        [
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          3,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          2,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          1,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          2,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          1,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          1,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          2,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          2,
          2,
          1,
          1
        ]
      ],
      "spellList": "druid"
    },
    "subclassAvailableAtLevel": 2,
    "subclasses": [
      {
        "id": "land",
        "name": "大地结社",
        "description": "大地结社是由神秘主义者和贤者所组成，通过广泛的口述传承来守护古老知识和仪式。作为结社中的一员，你的魔法将被你在入会时所施展神秘结社仪式的大地环境所影响。",
        "traits": [
          {
            "name": "额外戏法",
            "description": "你习得一个自选的额外德鲁伊戏法。",
            "level": 2,
            "choices": [
              {
                "id": "circle-land-extra-cantrip",
                "name": "选择一个德鲁伊戏法",
                "chooseNumber": 1,
                "dynamic": "spell",
                "spellType": "cantrip",
                "spellList": "druid"
              }
            ]
          },
          {
            "name": "自然恢复",
            "description": "你可以借由静坐冥想并与自然沟通来回复你一部份的魔法能量。在短休期间，你选择并恢复已消耗的法术位。这些法术位可以是环阶总和等于或低于你一半德鲁伊等级（向上取整）的复数法术位，且这些法术位个别的环阶不能是6环或更高。",
            "level": 2
          },
          {
            "name": "结社法术",
            "description": "你与大地之间的神秘联系使你获得能施放特定法术的能力。在3级、5级、7级、和9级时，你将获得与你成为德鲁伊时所在大地相连的结社法术。一旦你获得结社法术，你将永远视作已经准备了它，且它不会计入你每日可准备的法术数量中。完整的环境法术列表请查阅 [大地结社法术](https://5e.dickytwister.org/classes.html#德鲁伊_phb,state:sub-land-phb=b1)。",
            "level": 2
          },
          {
            "name": "大地行者",
            "description": "移动穿过非魔法的困难地形并不会花费你额外的移动速度。你也可以穿越非魔法植物而不会被它们减缓速度，若它们是荆棘、棘刺、或其他类似危险，你也不会被它们的伤害。此外，在对抗由魔法创造或控制的植物所造成的阻碍移动效果时，你所进行的豁免检定具有优势。",
            "level": 6
          },
          {
            "name": "自然之护",
            "description": "当你升至10级时，你将不会被元素或精类生物给魅惑或恐惧，且你将免疫于疾病和毒素（包含中毒状态）。",
            "level": 10
          },
          {
            "name": "自然庇护",
            "description": "自然界的生物们将察觉到你与大自然之间的联系，而犹豫于攻击你。当一个野兽或植物生物攻击你时，该生物必须进行一次对抗你德鲁伊法术豁免DC的感知豁免。若豁免失败，该生物必须选择一个不同的目标，否则该攻击将自动失手。若豁免成功，该生物将在接下来24小时内免疫于此效果。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "moon",
        "name": "月亮结社",
        "description": "月亮结社的德鲁伊都是凶猛的荒野卫士。如月亮一样善变，这个结社的德鲁伊可能会在夜晚如大猫徘徊，在隔日如鹰隼盘旋于树顶，并以熊型态横扫灌木。",
        "traits": [
          {
            "name": "战斗荒野形态",
            "description": "你获得在你的回合以一个附赠动作，而非一个动作来使用荒野形态型态的能力。此外，当你通过荒野型态而处于变形状态时，你可以使用一个附赠动作以消耗一个法术位，回复等同于被消耗法术位的每环阶1d8点的生命值。",
            "level": 2
          },
          {
            "name": "结社型态",
            "description": "你结社的仪式赋予你转变成更加危险动物型态的能力。你可以使用你的荒野形态以转变成一个挑战等级最高为1的野兽。从6级开始，你可以转变成一个挑战等级最高等同于你德鲁伊等级除以3（向下取整）的野兽。",
            "level": 2
          },
          {
            "name": "原初打击",
            "description": "在克服对非魔法攻击和伤害的抗性和免疫能力时，你在野兽型态下的攻击被视作魔法攻击。",
            "level": 6
          },
          {
            "name": "元素荒野形态",
            "description": "你可以同时花费二次荒野形态的使用次数，以转变成一个气元素、土元素、火元素或水元素。",
            "level": 10
          },
          {
            "name": "千面相",
            "description": "你学会以更精细的方式用魔法改变自己的身体型态。你可以随意施放变造自身法术。",
            "level": 14
          }
        ],
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "WIS",
          "min": 13
        }
      ],
      "proficiencies": {
        "armor": [
          "轻甲",
          "中甲",
          "盾牌（德鲁伊不能穿戴或使用金属制成的护甲和盾牌）"
        ]
      }
    }
  },
  {
    "id": "fighter",
    "name": "战士",
    "description": "精通各种战斗技巧与武器防具的大师。无论选择重装阵线、快如闪电的双刀流还是百步穿杨的弓箭技巧，他们都能以无与伦比的身手一次又一次地发起攻击，运用卓越的战技主宰战场。",
    "hitDie": 10,
    "primaryAbility": [
      "STR",
      "DEX"
    ],
    "saves": [
      "STR",
      "CON"
    ],
    "armorProficiencies": [
      "轻甲",
      "中甲",
      "重甲",
      "盾牌"
    ],
    "weaponProficiencies": [
      "简易武器",
      "军用武器"
    ],
    "toolProficiencies": [],
    "skills": {
      "count": 2,
      "choices": [
        "特技",
        "驯兽",
        "运动",
        "历史",
        "洞悉",
        "威吓",
        "察觉",
        "生存"
      ]
    },
    "startingEquipment": [
      "(a)一件锁子甲 或 (b)一件皮甲、一把长弓和20支箭",
      "(a)一把军用武器和一面盾牌 或 (b)两把军用武器",
      "(a)一把轻弩和20支弩矢 或 (b)二把手斧",
      "(a)一套地城探险家套装 或 (b)一套探索者套装"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "fighter-skills",
            "name": "选择 2 个技能熟练",
            "chooseNumber": 2,
            "options": [
              {
                "id": "acrobatics",
                "name": "特技"
              },
              {
                "id": "animalHandling",
                "name": "驯兽"
              },
              {
                "id": "athletics",
                "name": "运动"
              },
              {
                "id": "history",
                "name": "历史"
              },
              {
                "id": "insight",
                "name": "洞悉"
              },
              {
                "id": "intimidation",
                "name": "威吓"
              },
              {
                "id": "perception",
                "name": "察觉"
              },
              {
                "id": "survival",
                "name": "生存"
              }
            ]
          },
          {
            "id": "fighter-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一件锁子甲"
              },
              {
                "id": "opt-1",
                "name": "(b)一件皮甲、一把长弓和20支箭"
              }
            ]
          },
          {
            "id": "fighter-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把军用武器和一面盾牌"
              },
              {
                "id": "opt-1",
                "name": "(b)两把军用武器"
              }
            ]
          },
          {
            "id": "fighter-equip-2",
            "name": "装备组 3 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把轻弩和20支弩矢"
              },
              {
                "id": "opt-1",
                "name": "(b)二把手斧"
              }
            ]
          },
          {
            "id": "fighter-equip-3",
            "name": "装备组 4 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一套地城探险家套装"
              },
              {
                "id": "opt-1",
                "name": "(b)一套探索者套装"
              }
            ]
          },
          {
            "id": "fighter-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "战斗风格",
        "description": "你采用一种特殊的战斗风格以作为你的专业。从下列选项中选择一种。你不能获得相同的战斗风格选项超过一次，即使你有机会再选择它也一样。",
        "level": 1,
        "choices": [
          {
            "id": "fighting-style-1",
            "name": "选择一种战斗风格",
            "chooseNumber": 1,
            "options": [
              {
                "id": "archery",
                "name": "弓道",
                "description": "你在使用远程武器进行的攻击检定中获得+2加值。"
              },
              {
                "id": "defense",
                "name": "防御",
                "description": "当你穿戴护甲时，你的AC获得+1加值。"
              },
              {
                "id": "dueling",
                "name": "决斗",
                "description": "当你单手持用一把近战武器，且没有持用其他武器时，你在使用该武器所进行的伤害骰中获得+2加值。"
              },
              {
                "id": "gwf",
                "name": "巨武战斗",
                "description": "当你在使用一把以双手持用的近战武器所进行攻击的伤害骰中骰出了1或2的结果，你可以重骰该骰，且必须使用新的掷骰结果，即使其结果仍然是1或2。该武器必须具有双手或可双手属性才能让你获得这个好处。"
              },
              {
                "id": "protection",
                "name": "守护",
                "description": "当一个你所能看见的生物攻击一个距离你5尺内你以外的目标，你可以使用你的反应以让该攻击检定承受劣势。你必须持握一面盾牌。"
              },
              {
                "id": "twf",
                "name": "双武器战斗",
                "description": "当你进行双武器战斗时，你可以将你的属性调整值加入第二次攻击的伤害中。"
              }
            ]
          }
        ]
      },
      {
        "name": "回气",
        "description": "你拥有有限的充沛精力让你得以利用于保护自己不受伤害。在你的回合，你可以使用一个附赠动作以回复等同于1d10 + 你的战士等级的生命值。一旦你使用此能力，你必须完成一次短休或长休后才能再使用它。",
        "level": 1
      },
      {
        "name": "动作如潮",
        "description": "从2级开始，你可以短暂地驱策自己超越你的极限。在你的回合，你可以在你原本的动作和可能的附赠动作之后，另外再采取一次额外的动作。一旦你使用此能力，你必须完成一次短休或长休后才能再使用它。从17级开始，你可以在一次休息前使用它二次，但同个回合只能使用一次。",
        "level": 2
      },
      {
        "name": "武术范型",
        "description": "在3级时，你从可选列表中选择一种你致力在你战斗风格和技巧中达成的范型。你所选择的范型将在3级、7级、10级、15级、和18级时赋予你新的能力。",
        "level": 3
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至4级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 4,
        "choices": [
          {
            "id": "fighter-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "额外攻击",
        "description": "从5级开始，每当你在自己回合执行攻击动作时，你可以发动两次攻击，而非一次。当你在此职业升至11级时，攻击的次数增加到三，且当你在此职业升至20级时，攻击的次数增加到四。",
        "level": 5
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至6级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 6,
        "choices": [
          {
            "id": "fighter-asi-6",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "武术范型能力",
        "description": "在7级时，你获得一个由你武术范型所赋予的能力。",
        "level": 7
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至8级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 8,
        "choices": [
          {
            "id": "fighter-asi-8",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "不屈",
        "description": "从9级开始，你可以在你一次失败的豁免检定中重骰。若你这么做，你必须使用新的掷骰结果，且你直到完成一次长休之前都不能再使用此能力。从13级开始，你可以在长休之间使用此能力二次，且从17级开始，你可以在长休之间使用此能力三次。",
        "level": 9
      },
      {
        "name": "武术范型能力",
        "description": "在10级时，你获得一个由你武术范型所赋予的能力。",
        "level": 10
      },
      {
        "name": "额外攻击(2)",
        "description": "从11级开始，每当你在你的回合采取攻击动作，你可以攻击三次。",
        "level": 11
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至12级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 12,
        "choices": [
          {
            "id": "fighter-asi-12",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "不屈(2次)",
        "description": "在13级时，你可以在长休之间使用不屈二次。",
        "level": 13
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至14级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 14,
        "choices": [
          {
            "id": "fighter-asi-14",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "武术范型能力",
        "description": "在15级时，你获得一个由你武术范型所赋予的能力。",
        "level": 15
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至16级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 16,
        "choices": [
          {
            "id": "fighter-asi-16",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "动作如潮(2次)",
        "description": "在17级时，你可以在一次休息前使用动作如潮二次，但同个回合只能使用一次。",
        "level": 17
      },
      {
        "name": "不屈(3次)",
        "description": "在17级时，你可以在长休之间使用不屈三次。",
        "level": 17
      },
      {
        "name": "武术范型能力",
        "description": "在18级时，你获得一个由你武术范型所赋予的能力。",
        "level": 18
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至19级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 19,
        "choices": [
          {
            "id": "fighter-asi-19",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "额外攻击(3)",
        "description": "从20级开始，每当你在你的回合采取攻击动作，你可以攻击四次。",
        "level": 20
      }
    ],
    "subclassAvailableAtLevel": 3,
    "subclasses": [
      {
        "id": "champion",
        "name": "勇士",
        "description": "勇士范型专注于发展纯粹的身体能力，将其磨练到完美。那些仿效于此范型的人们结合严格的训练和卓越的身体素质以造成最致命的打击。",
        "traits": [
          {
            "name": "强化重击",
            "description": "你的武器攻击将在骰出19或20时造成重击。",
            "level": 3
          },
          {
            "name": "运动健将",
            "description": "你可以将你熟练加值的一半（向上取整）加入任何你尚未加入熟练加值的力量、敏捷、或体质检定中。此外，当你进行助跑跳远时，你可以跨越的距离将增加等同于你力量调整值的尺数。",
            "level": 7
          },
          {
            "name": "额外战斗风格",
            "description": "你可以从战斗风格的职业能力中选择第二个选项。",
            "level": 10
          },
          {
            "name": "精通强化重击",
            "description": "你的武器攻击将在骰出18-20时造成重击。",
            "level": 15
          },
          {
            "name": "存活者",
            "description": "只要你没有陷入无力状态，且你的生命值不足一半，则你可以在你的每个回合开始时回复5+你体质调整值点生命值。",
            "level": 18
          }
        ],
        "source": "phb"
      },
      {
        "id": "battle-master",
        "name": "战斗大师",
        "description": "战斗大师是将战斗视为学术一般的人。对他们来说，战斗就是一门学术。战斗大师范型包含了一些在战斗以外的专业，像是武器锻造和书法等等。",
        "traits": [
          {
            "name": "战争学徒",
            "description": "你获得一种你所选的工匠工具的熟练。",
            "level": 3
          },
          {
            "name": "战斗卓越",
            "description": "你学会各种战技，并借由被称作卓越骰的特殊骰子驱动它们。你学会三个自选战技。你拥有四颗卓越骰，这四颗卓越骰为d8。卓越骰将在你使用战技时被花费。你在完成一次短休或长休后恢复你花费掉的卓越骰。你将在7级、和15级时再获得一颗卓越骰。",
            "level": 3,
            "choices": [
              {
                "id": "combat-superiority-maneuvers",
                "name": "选择三个战技",
                "chooseNumber": 3,
                "options": [
                  {
                    "id": "commanding_strike",
                    "name": "指挥打击",
                    "description": "放弃攻击，指挥同伴攻击一次。"
                  },
                  {
                    "id": "disarming_attack",
                    "name": "卸除武器攻击",
                    "description": "命中后迫使目标豁免，失败则掉落武器。"
                  },
                  {
                    "id": "distracting_strike",
                    "name": "分神打击",
                    "description": "命中后给下一位攻击它的同伴提供优势。"
                  },
                  {
                    "id": "evasive_footwork",
                    "name": "闪避步法",
                    "description": "移动时增加AC。"
                  },
                  {
                    "id": "feinting_attack",
                    "name": "佯攻",
                    "description": "附赠动作，对目标获得攻击优势并附加伤害。"
                  },
                  {
                    "id": "goading_attack",
                    "name": "挑衅攻击",
                    "description": "命中后迫使目标豁免，失败则对除你外目标攻击劣势。"
                  },
                  {
                    "id": "lunging_attack",
                    "name": "猛冲攻击",
                    "description": "增加5尺触及距离。"
                  },
                  {
                    "id": "maneuvering_attack",
                    "name": "机动攻击",
                    "description": "命中后同伴可以使用反应移动而不会引发借机攻击。"
                  },
                  {
                    "id": "menacing_attack",
                    "name": "威吓攻击",
                    "description": "命中后迫使目标豁免，失败则陷入恐慌。"
                  },
                  {
                    "id": "parry",
                    "name": "招架",
                    "description": "受损时使用反应减少伤害。"
                  },
                  {
                    "id": "precision_attack",
                    "name": "精准攻击",
                    "description": "攻击检定投掷卓越骰增加命中。"
                  },
                  {
                    "id": "pushing_attack",
                    "name": "推撞攻击",
                    "description": "命中后迫使大型或更小目标豁免，失败被推开15尺。"
                  },
                  {
                    "id": "rally",
                    "name": "重整旗鼓",
                    "description": "附赠动作，使同伴获得临时生命值。"
                  },
                  {
                    "id": "riposte",
                    "name": "反击",
                    "description": "若目标未命中你，使用反应对其进行一次攻击。"
                  },
                  {
                    "id": "sweeping_attack",
                    "name": "扫击",
                    "description": "同时伤害命中范围内的第二个敌人。"
                  },
                  {
                    "id": "trip_attack",
                    "name": "绊倒攻击",
                    "description": "大型或更小目标豁免，失败倒地。"
                  }
                ]
              }
            ]
          },
          {
            "name": "知己知彼",
            "description": "若你花费至少1分钟的时间在战斗外观察另一个生物或与之交互，则你可以得知某些关于它能力的情报。DM将会告诉你在你所选择的两个项目中，该生物的能力是与你相同、强于你、或是弱于你。",
            "level": 7
          },
          {
            "name": "额外战技/卓越骰",
            "description": "在7级、10级、15级时学会二个额外的战技。7级和15级再获得一颗卓越骰。",
            "level": 7
          },
          {
            "name": "精通战斗卓越 (d10)",
            "description": "你的卓越骰变更为d10。",
            "level": 10
          },
          {
            "name": "顽强",
            "description": "当你掷先攻时且已经没有剩下的卓越骰时，你获得一颗卓越骰。",
            "level": 15
          },
          {
            "name": "精通战斗卓越 (d12)",
            "description": "你的卓越骰变更为d12。",
            "level": 18
          }
        ],
        "source": "phb"
      },
      {
        "id": "eldritch-knight",
        "name": "魔能骑士",
        "description": "典范的魔能骑士将武艺与魔法相结合。他们专注于防护系和塑能系的研习，以此强化自己的防御与群体杀伤力。",
        "traits": [
          {
            "name": "施法",
            "description": "你以施放法术的能力增进了你的战斗实力。戏法：你学会二个从法师法术列表自选的戏法。你将在10级时学会一个额外的法师戏法。法术位：魔能骑士施法表中显示了你有多少个法术位可以用来施放你一环或更高环的法师法术。要施放其中一个法术，你必须消耗一个与该法术环阶相同或更高的法术位。你在完成一次长休后恢复所有你花费掉的法术位。一环或更高环的已知法术：你知晓三个从法师法术列表中自选的1环法术，其中二个必须从法师法术列表中的防护系和塑能系法术中选择。你在8级、14级、和20级时所学会的法术可以来自任何魔法学派。每当你提升这个职业的等级时，你可以从法师法术列表中挑选一个法术来取代一个你目前已知的法师法术。新法术的环阶必须符合你所拥有法术位的环阶，且它必须是一个防护系或塑能系法术，除非你取代的法术是你在3级、8级、14级、或20级时所获得的来自任意魔法学派的法术。施法属性：智力是你施展法师法术的施法属性。法术豁免DC = 8 + 你的熟练加值 + 你的智力调整值。法术攻击调整值 = 你的熟练加值 + 你的智力调整值。",
            "level": 3,
            "choices": [
              {
                "id": "spells-step-cantrips",
                "name": "选择两个法师戏法",
                "chooseNumber": 2,
                "dynamic": "spell",
                "spellType": "cantrip",
                "spellList": "wizard"
              },
              {
                "id": "spells-step-leveled",
                "name": "选择三个1环法师法术（至少两个防护/塑能）",
                "chooseNumber": 3,
                "dynamic": "spell",
                "spellType": "known",
                "spellList": "wizard",
                "maxLevel": 1,
                "schoolRestriction": [
                  "防护系",
                  "塑能系"
                ]
              }
            ]
          },
          {
            "name": "武器联结",
            "description": "你学会一个用以在你和一把武器间创造出魔法联结的仪式。一旦你与一把武器创建联结，除非你处于无力状态，否则你的联结武器不会被缴械。你可以在你的回合以一个附赠动作召唤该武器，使它瞬间被传送到你手中。你可以有最多二把联结武器。",
            "level": 3
          },
          {
            "name": "战争魔法",
            "description": "当你使用你的动作以施放一个戏法，你能够以一个附赠动作进行一次武器攻击。",
            "level": 7
          },
          {
            "name": "魔能打击",
            "description": "你学会如何让你的武器打击削弱一个生物对你法术的抗性。当你以一次武器攻击命中一个生物，直到你的下个回合结束之前，该生物在下一次对抗你所施放法术时所进行的豁免检定将具有劣势。",
            "level": 10
          },
          {
            "name": "秘法冲锋",
            "description": "你可以在使用你的动作如潮能力时，传送最多30尺距离到一处你所能看见的未被占据空间。",
            "level": 15
          },
          {
            "name": "精通战争魔法",
            "description": "当你使用你的动作以施放一个法术，你能够以一个附赠动作进行一次武器攻击。",
            "level": 18
          }
        ],
        "spellcasting": {
          "type": "known",
          "ability": "INT",
          "spellList": "wizard",
          "cantripsKnown": [
            0,
            0,
            2,
            2,
            2,
            2,
            2,
            2,
            2,
            3,
            3,
            3,
            3,
            3,
            3,
            3,
            3,
            3,
            3,
            3
          ],
          "spellsKnown": [
            0,
            0,
            3,
            4,
            4,
            4,
            5,
            6,
            6,
            7,
            8,
            8,
            9,
            10,
            10,
            11,
            11,
            11,
            11,
            13
          ],
          "spellSlots": [
            [
              0,
              0,
              0,
              0
            ],
            [
              0,
              0,
              0,
              0
            ],
            [
              2,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0
            ],
            [
              4,
              3,
              2,
              0
            ],
            [
              4,
              3,
              2,
              0
            ],
            [
              4,
              3,
              2,
              0
            ],
            [
              4,
              3,
              3,
              0
            ],
            [
              4,
              3,
              3,
              0
            ],
            [
              4,
              3,
              3,
              0
            ],
            [
              4,
              3,
              3,
              1
            ],
            [
              4,
              3,
              3,
              1
            ]
          ]
        },
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "group": "OR",
          "options": [
            {
              "ability": "STR",
              "min": 13
            },
            {
              "ability": "DEX",
              "min": 13
            }
          ]
        }
      ],
      "proficiencies": {
        "armor": [
          "轻甲",
          "中甲",
          "盾牌"
        ],
        "weapons": [
          "简易武器",
          "军用武器"
        ]
      }
    }
  },
  {
    "id": "monk",
    "name": "武僧",
    "description": "追求肉身与精神完美结合的武术巨匠。凭藉流淌于体内的“气”，他们能摆脱盔甲与武器的束缚，施展狂风暴雨般的徒手连击，并在空中漫步甚至截住飞来的箭矢。",
    "hitDie": 8,
    "primaryAbility": [
      "DEX",
      "WIS"
    ],
    "saves": [
      "STR",
      "DEX"
    ],
    "armorProficiencies": [
      "无"
    ],
    "weaponProficiencies": [
      "简易武器",
      "短剑"
    ],
    "toolProficiencies": [
      "自选一种工匠工具或乐器"
    ],
    "skills": {
      "count": 2,
      "choices": [
        "特技",
        "运动",
        "历史",
        "洞悉",
        "宗教",
        "隐匿"
      ]
    },
    "startingEquipment": [
      "(a)一把短剑 或 (b)任意一把简易武器",
      "(a)一套地城探险家套装 或 (b)一套探索者套装",
      "10支飞镖"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "monk-skills",
            "name": "选择 2 个技能熟练",
            "chooseNumber": 2,
            "options": [
              {
                "id": "acrobatics",
                "name": "特技"
              },
              {
                "id": "athletics",
                "name": "运动"
              },
              {
                "id": "history",
                "name": "历史"
              },
              {
                "id": "insight",
                "name": "洞悉"
              },
              {
                "id": "religion",
                "name": "宗教"
              },
              {
                "id": "stealth",
                "name": "隐匿"
              }
            ]
          },
          {
            "id": "monk-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把短剑"
              },
              {
                "id": "opt-1",
                "name": "(b)任意一把简易武器"
              }
            ]
          },
          {
            "id": "monk-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一套地城探险家套装"
              },
              {
                "id": "opt-1",
                "name": "(b)一套探索者套装"
              }
            ]
          },
          {
            "id": "monk-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "无甲防御",
        "description": "从1级开始，当你未穿戴护甲且未持用盾牌时，你的AC等于10 + 你的敏捷调整值 + 你的感知调整值。",
        "level": 1
      },
      {
        "name": "武艺",
        "description": "你在武术上的练习让你掌握了使用徒手打击和武僧武器的战斗方式。当你在你的回合以徒手打击或一把武僧武器采取攻击动作，你能够以附赠动作进行一次徒手打击。",
        "level": 1
      },
      {
        "name": "气",
        "description": "从2级开始，你所受的训练让你得以驾驭这被称为气的神秘能量。你可以消耗这些气以驱动多种与气有关能力：疾风连击、坚强防御、以及飞檐走壁。",
        "level": 2
      },
      {
        "name": "无甲移动",
        "description": "从2级开始，当你未穿戴护甲或持用盾牌时，你的移动速度增加10尺。9级时获得沿垂直表面或横越水面移动而不至于摔落的能力。",
        "level": 2
      },
      {
        "name": "拨挡飞弹",
        "description": "从3级开始，当你被一次远程武器攻击命中时，你可以使用你的反应以拨挡或抓住该投射物。若你将该伤害降低至零且抓住投射物，你可以消耗1点气以使用刚抓到的武器或弹药进行一次远程攻击。",
        "level": 3
      },
      {
        "name": "宗派传承",
        "description": "当你升至3级时，你将投身于一种宗派传承。你的宗派将在3级、6级、11级、和17级时赋予你新的能力。",
        "level": 3
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至4级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 4,
        "choices": [
          {
            "id": "monk-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "轻身坠",
        "description": "从4级开始，当你坠落时，你可以使用你的反应以将任何你所受到的坠落伤害减少等同于你五倍武僧等级的数值。",
        "level": 4
      },
      {
        "name": "额外攻击",
        "description": "从5级开始，每当你在自己回合执行攻击动作时，你可以发动两次攻击，而非一次。",
        "level": 5
      },
      {
        "name": "震慑拳",
        "description": "从5级开始，你可以干扰一个对手体内气的流动。当你以近战武器攻击命中另一个生物时，你可以消耗1点气以尝试进行一次震慑拳。目标必须成功通过一次体质豁免，否则被震慑直到你的下个回合结束。",
        "level": 5
      },
      {
        "name": "真气驻拳",
        "description": "从6级开始，在克服对非魔法攻击和伤害的抗性和免疫能力时，你的徒手打击被视作魔法武器。",
        "level": 6
      },
      {
        "name": "宗派传承能力",
        "description": "在6级时，你获得一个来自你宗派传承的能力。",
        "level": 6
      },
      {
        "name": "反射闪避",
        "description": "在7级时，你直觉性的灵活身法让你能够躲开某些范围效果。当你成为一个允许你进行敏捷豁免以仅承受一半伤害的效果的目标时，你改为在豁免成功时不受任何伤害，且在豁免失败时仅承受一半伤害。",
        "level": 7
      },
      {
        "name": "心头灭却",
        "description": "从7级开始，你可以使用你的动作以结束一个让你被魅惑或恐惧的效果。",
        "level": 7
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至8级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 8,
        "choices": [
          {
            "id": "monk-asi-8",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "无甲移动强化",
        "description": "在9级时，你获得在你的回合移动期间，可以沿着垂直表面或横越水面移动而不至于摔落的能力。",
        "level": 9
      },
      {
        "name": "百病不侵",
        "description": "在10级时，流通于你周身的气让你免疫于疾病和毒素（包含中毒状态）。",
        "level": 10
      },
      {
        "name": "宗派传承能力",
        "description": "在11级时，你获得一个来自你宗派传承的能力。",
        "level": 11
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至12级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 12,
        "choices": [
          {
            "id": "monk-asi-12",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "天语通",
        "description": "从13级开始，你习得接触其他心灵中的气魂，好让你理解所有被说出的语言。同时，任何理解至少一种语言的生物也都可以理解你所说的话。",
        "level": 13
      },
      {
        "name": "金刚魂",
        "description": "从14级开始，你对气的掌握让你熟练于所有的豁免检定。此外，每当你进行一次豁免检定且豁免失败，你可以消耗1点气以重骰它并使用第二个掷骰结果。",
        "level": 14
      },
      {
        "name": "不朽身躯",
        "description": "在15级时，你体内的气将维持你免受任何衰老的弊害，且你不会被魔法变老。然而，你仍然会因为衰老而死亡。此外，你将不再需要食物和饮水。",
        "level": 15
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至16级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 16,
        "choices": [
          {
            "id": "monk-asi-16",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "宗派传承能力",
        "description": "在17级时，你获得一个来自你宗派传承的能力。",
        "level": 17
      },
      {
        "name": "空灵体",
        "description": "从18级开始，你可以使用你的动作消耗4点气以变得隐形长达1分钟。在这段期间，你同时获得对除了力场伤害以外所有伤害的抗性。此外，你可以消耗8点气以施放星界投影法术。",
        "level": 18
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至19级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 19,
        "choices": [
          {
            "id": "monk-asi-19",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "超凡魂",
        "description": "在20级时，当你掷先攻时且已经没有剩下的气时，你获得4点气。",
        "level": 20
      }
    ],
    "subclassAvailableAtLevel": 3,
    "subclasses": [
      {
        "id": "open-hand",
        "name": "散打宗",
        "description": "散打宗的武僧都是武术格斗的终极大师，无论是持武还是空手。他们学习推撞与绊摔对手的技巧。",
        "traits": [
          {
            "name": "散打技巧",
            "description": "当你使用你疾风连击所赋予的其中一次攻击命中一个生物时，你可以对该目标强加下列其中一个效果：它必须成功通过一次敏捷豁免，否则被击倒伏地；它必须进行一次力量豁免，若豁免失败则推离最多15尺；它直到你的下个回合结束前都不能采取反应。",
            "level": 3
          },
          {
            "name": "混元体",
            "description": "你获得治疗你自己的能力。以一个动作，你可以回复等同于你武僧等级三倍的生命值。你必须完成一次长休之后才能再次使用此能力。",
            "level": 6
          },
          {
            "name": "凝神境",
            "description": "你可以进入一种特别的冥想以使你周遭环绕着一道和平灵光。在一次长休结束时，你将获得圣域术法术的效果，持续直到你的下一次长休开始。",
            "level": 11
          },
          {
            "name": "震颤掌",
            "description": "你获得在某人体内制造致命震颤的能力。当你以徒手打击命中一个生物时，你可以消耗3点气以让这阵难以察觉的震动在目标体内开始鼓动。你可以使用你的动作以结束它，目标体质豁免失败则生命值归零，成功则10d10黯蚀伤害。",
            "level": 17
          }
        ],
        "source": "phb"
      },
      {
        "id": "shadow",
        "name": "暗影宗",
        "description": "暗影宗武僧尊奉黑暗之美，擅长刺杀、潜行与间谍活动。他们视暗影为平等之地，化身来无影去无踪的忍者、密使或刺客，将自身完美融于无边阴影之中。",
        "traits": [
          {
            "name": "影之技艺",
            "description": "你可以使用你的气以拷贝特定法术的效果。以一个动作，你可以消耗2点气以施放黑暗术、黑暗视觉、行踪无迹或沉默术，且无须提供材料构材。此外，若你尚未知晓次级幻象戏法，则你将习得它。",
            "level": 3
          },
          {
            "name": "暗影步",
            "description": "你获得穿梭于阴影之间的能力。当你处于微光光照或黑暗环境时，以一个附赠动作，你可以传送最多60尺距离到一处你所能看见，且同样处于微光光照或黑暗环境的未被占据空间。接着你在该回合结束前所进行的第一次近战攻击检定中具有优势。",
            "level": 6
          },
          {
            "name": "暗影斗篷",
            "description": "当你处于微光光照或黑暗环境时，你可以使用你的动作以变得隐形。你保持隐形状态直到你进行一次攻击、施放法术、或处于明亮光照的区域。",
            "level": 11
          },
          {
            "name": "趁人之危",
            "description": "你可以利用一个生物被攻击命中时所产生的瞬间分神。当一个距离你5尺内的生物被除你以外的另一个生物的攻击命中，你可以使用你的反应以对该生物进行一次近战攻击。",
            "level": 17
          }
        ],
        "source": "phb"
      },
      {
        "id": "four-elements",
        "name": "四象宗",
        "description": "四象宗武僧能将体内的“气”转化为风、地、火、水四大要素的力量。他们直接沟通周遭自然，可释放毁灭性的元素攻击或塑形魔法，展现超凡的自然掌控力。",
        "traits": [
          {
            "name": "元素门徒",
            "description": "你学会驾驭四元素力量的魔法法门。每种法门都会要求你在每次使用它的时候消耗气。\n\n你知晓元素调律法门、以及另外一个你所选择的四象法门。你将在6级、11级、和17级时各学会一个你所选择的额外四象法门。每当你学会一个新的四象法门，你也可以将其中一个你已知的四象法门替换成另一个不同的法门。\n\n施放元素法术. 有些四象法门会允许你施放法术。请参阅第十章以了解关于施法的通用规则。要施放其中一个这些法术，你使用该法术的施法时间和其他规则，但你不需要为其提供材料构材。一旦你在本职业升至5级时，你可以消耗额外的气以提升你通过四象法门所施放的法术的环阶，只要该法术在以更高法术位施放时具有升阶效果。你每额外消耗1点气，就可以使该法术的环阶提升1环。你通过这个方式施放法术时所能消耗的气的最大值由你的武僧等级决定。在5级时，你可以消耗最多3点气；9级时增加到4点气；13级时5点；17级时6点。\n\n四象法门列表：\n寒冬之息（17级）. 消耗6气施放寒冰锥。\n北风之握（6级）. 消耗3气施放人类定身术。\n元素调律. 动作控制30尺内的元素，制造无害效果或形塑水火土风。\n苍山庇佑（17级）. 消耗5气以自己为目标施放石肤术。\n火蛇利牙. 消耗1气让近战攻击延伸10尺并造成火焰伤害。\n四雷拳. 消耗2气施放雷鸣波。\n凤凰火（11级）. 消耗4气施放火球术。\n狮吼功（6级）. 消耗3气施放粉碎音波。\n云雾式（11级）. 消耗4气以自己为目标施放气化形体。\n攀云步（11级）. 消耗4气以自己为目标施放飞行术。\n噬焰流（17级）. 消耗5气施放火墙术。\n风灵突进. 消耗2气施放造风术。\n形塑流川. 消耗1气改变冰水的形态。\n飞炎击. 消耗2气施放燃烧之手。\n凝气刚拳. 消耗2气远距离打击生物造成钝击并推开。\n清流鞭. 消耗2气创造水鞭打击和拉拽敌人。\n滚石浪（17级）. 消耗6气施放石墙术。",
            "level": 3
          }
        ],
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "DEX",
          "min": 13
        },
        {
          "ability": "WIS",
          "min": 13
        }
      ],
      "proficiencies": {
        "weapons": [
          "简易武器",
          "短剑"
        ]
      }
    }
  },
  {
    "id": "paladin",
    "name": "圣武士",
    "description": "宣发了神圣誓言，身披重甲的神圣斗士。他们不仅仅拥有足以劈开黑暗的近战武技，还能够引导神圣属性魔法为自己与盟友提供强有力的恢复与防护灵光，甚至用至圣斩重创强敌。",
    "hitDie": 10,
    "primaryAbility": [
      "STR",
      "CHA"
    ],
    "saves": [
      "WIS",
      "CHA"
    ],
    "armorProficiencies": [
      "轻甲",
      "中甲",
      "重甲",
      "盾牌"
    ],
    "weaponProficiencies": [
      "简易武器",
      "军用武器"
    ],
    "toolProficiencies": [],
    "skills": {
      "count": 2,
      "choices": [
        "运动",
        "洞悉",
        "威吓",
        "医疗",
        "说服",
        "宗教"
      ]
    },
    "startingEquipment": [
      "(a)一把军用武器和一面盾牌 或 (b)二把军用武器",
      "(a)五把标枪 或 (b)任意一把简易近战武器",
      "(a)一套祭司套装 或 (b)一套探索者套装",
      "一件锁子甲和一个圣徽"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "paladin-skills",
            "name": "选择 2 个技能熟练",
            "chooseNumber": 2,
            "options": [
              {
                "id": "athletics",
                "name": "运动"
              },
              {
                "id": "insight",
                "name": "洞悉"
              },
              {
                "id": "intimidation",
                "name": "威吓"
              },
              {
                "id": "medicine",
                "name": "医疗"
              },
              {
                "id": "persuasion",
                "name": "说服"
              },
              {
                "id": "religion",
                "name": "宗教"
              }
            ]
          },
          {
            "id": "paladin-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把军用武器和一面盾牌"
              },
              {
                "id": "opt-1",
                "name": "(b)二把军用武器"
              }
            ]
          },
          {
            "id": "paladin-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)五把标枪"
              },
              {
                "id": "opt-1",
                "name": "(b)任意一把简易近战武器"
              }
            ]
          },
          {
            "id": "paladin-equip-2",
            "name": "装备组 3 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一套祭司套装"
              },
              {
                "id": "opt-1",
                "name": "(b)一套探索者套装"
              }
            ]
          },
          {
            "id": "paladin-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "神圣感知",
        "description": "强大的邪恶对你来说就像是令人作呕的臭气，而强大的善良在你的耳中就如同仙乐般鸣响。以一个动作，你可以扩张你的意识以侦测这类力量。直到你的下个回合结束前，你知晓任何距离你60尺内，且未处于全掩护的天界生物、邪魔、或不死生物的位置。你知晓被你感知到的存在的种类，但无法知晓它的身分。在同样的范围内，你也可以侦测到任何被像是圣居法术给祝圣或亵渎的场所或物体。你可以使用这个能力的次数等同于1 + 你的魅力调整值。当你完成一次长休，你恢复所有你花费掉的次数。",
        "level": 1
      },
      {
        "name": "圣疗",
        "description": "你祝福的碰触可以医治伤口。你拥有一个治疗能量池，会在你每次长休后补满。借由治疗能量池，你可以回复总共等同于你圣武士等级 x 5的生命值。以一个动作，你可以触碰一个生物并汲取治疗池中的能量以让该生物回复一定数量的生命值，最多等同于你治疗池中剩余的数量。或者，你可以消耗你治疗池中的5点生命值，以治疗或中和一个正影响目标的疾病或毒素。你可以使用一次圣疗治疗复数个疾病并中和复数个毒素，但你必须为各疾病和毒素分别支付治疗池中的生命值。这个能力对不死生物和构装体没有任何效果。",
        "level": 1
      },
      {
        "name": "至圣斩",
        "description": "从2级开始，当你使用一次近战武器攻击命中一个生物，除了武器伤害以外，你可以消耗一个法术位以对目标造成额外的光耀伤害。这个额外伤害在消耗1环法术位时为2d8点，高于一环的法术位则每环再加上1d8点伤害，最高至5d8。若目标为不死生物或邪魔，则伤害再增加1d8点，最高至6d8。",
        "level": 2
      },
      {
        "name": "战斗风格",
        "description": "在2级时，你采用一种特殊的战斗风格以作为你的专业。",
        "level": 2,
        "choices": [
          {
            "id": "paladin-fighting-style",
            "name": "选择一种战斗风格",
            "chooseNumber": 1,
            "options": [
              {
                "id": "defense",
                "name": "防御",
                "description": "当你穿戴护甲时，你的AC获得+1加值。"
              },
              {
                "id": "dueling",
                "name": "决斗",
                "description": "当你单手持用一把近战武器，且没有持用其他武器时，你在使用该武器所进行的伤害骰中获得+2加值。"
              },
              {
                "id": "gwf",
                "name": "巨武战斗",
                "description": "当你在使用一把以双手持用的近战武器所进行攻击的伤害骰中骰出了1或2的结果，你可以重骰该骰，且必须使用新的掷骰结果，即使其结果仍然是1或2。该武器必须具有双手或可双手属性才能让你获得这个好处。"
              },
              {
                "id": "protection",
                "name": "守护",
                "description": "当一个你所能看见的生物攻击一个距离你5尺内你以外的目标，你可以使用你的反应以让该攻击检定承受劣势。你必须持握一面盾牌。"
              }
            ]
          }
        ]
      },
      {
        "name": "施法",
        "description": "从2级起，你学会了如牧师一般通过冥想和祈祷利用神圣魔法。请参阅第十章以了解关于施法的规则，以及第十一章以查阅圣武士法术列表。\n\n准备及施放法术\n圣武士表中显示了你有多少个法术位可以用来施放你一环或更高环的圣武士法术。要施放其中一个这些法术，你必须消耗一个与该法术环阶相同或更高的法术位。你在完成一次长休后恢复所有你花费掉的法术位。\n\n你准备一份你所能施放的圣武士法术列表，从圣武士法术列表中选择。当你这么做时，选择数量等同于你魅力调整值 + 你圣武士等级的一半（向下取整）的圣武士法术（最少一个法术）。这些法术的环阶都必须符合你所拥有法术位的环阶。\n\n举例来说，如果你是一个5级的圣武士，你拥有四个1环和二个2环的法术位。你的魅力为14，则你已准备法术的列表中可以包含总共四个1环或2环的法术。若你准备了1环法术治疗伤势，你可以使用1环和2环的法术位来施放它。施放法术并不会将它从你的准备法术列表中移除。\n\n你可以在你完成一次长休时改变你的准备法术列表。准备一份新的圣武士法术列表需要花费时间于祈祷和冥想：你需要为你列表上每个法术的每个环阶都花费至少1分钟的时间。\n\n施法属性\n因为你法术的能量源自于你信仰的强度，魅力是你施展圣武士法术的施法属性。每当一个法术提及你的施法属性时，你将使用你的魅力。此外，当决定你圣武士法术的豁免DC、以及使用圣武士法术进行攻击检定时，你使用你的魅力调整值。\n\n法术豁免DC = 8 + 你的熟练加值 + 你的魅力 调整值\n法术攻击调整值 = 你的熟练加值 + 你的魅力 调整值\n\n施法法器\n你可以使用一个圣徽，来作为你施放圣武士法术的法器。",
        "level": 2
      },
      {
        "name": "神性体魄",
        "description": "从3级起，在你体内涌动的神圣魔法使你免疫于疾病。",
        "level": 3
      },
      {
        "name": "神圣誓言",
        "description": "当你升至3级时，你立下永远作为圣武士的神圣誓言。你的选择将在3级、7级、15级、和20级时赋予你新的能力。这些能力包括了圣誓法术以及引导神力能力。",
        "level": 3
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至4级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 4,
        "choices": [
          {
            "id": "paladin-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "额外攻击",
        "description": "从5级开始，每当你在自己回合执行攻击动作时，你可以发动两次攻击，而非一次。",
        "level": 5
      },
      {
        "name": "守护灵光",
        "description": "从6级开始，每当你或一个距离你10尺内的友善生物必须进行一次豁免检定，该生物在该豁免检定中获得等同于你魅力调整值的加值（最少为+1）。18级时范围增加至30尺。",
        "level": 6
      },
      {
        "name": "神圣誓言能力",
        "description": "在7级时，你获得一个由你神圣誓言所赋予的能力。",
        "level": 7
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至8级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 8,
        "choices": [
          {
            "id": "paladin-asi-8",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "勇气灵光",
        "description": "从10级开始，你和任何距离你10尺内的友善生物不会在你意识清醒的时候陷入恐惧。18级范围扩展至30尺。",
        "level": 10
      },
      {
        "name": "强化至圣斩",
        "description": "从11级起，你是如此的充满公义之力，以至于你的所有近战武器打击都带着神圣的能量。每当你使用一把近战武器命中一个生物，该生物将受到额外的1d8光耀伤害。",
        "level": 11
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至12级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 12,
        "choices": [
          {
            "id": "paladin-asi-12",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "净化之触",
        "description": "从14级开始，你可以使用你的动作以结束一个作用于你自己或一个你所碰触自愿生物的法术。你可以使用这个能力的次数等同于你的魅力调整值（最少一次）。",
        "level": 14
      },
      {
        "name": "神圣誓言能力",
        "description": "在15级时，你获得一个由你神圣誓言所赋予的能力。",
        "level": 15
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至16级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 16,
        "choices": [
          {
            "id": "paladin-asi-16",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "灵光强化",
        "description": "在18级时，你的灵光的范围增加至30尺。",
        "level": 18
      },
      {
        "name": "属性值提升",
        "description": "当你在此职业升至19级时，你可以增加一项自选属性值2点，或着你可以增加二项自选属性值各1点。如同平常一样，你不能通过这个能力将一个属性值提升至超过20。如果你的DM允许使用专长的话，你也可以改为获得一个专长。",
        "level": 19,
        "choices": [
          {
            "id": "paladin-asi-19",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "神圣誓言能力",
        "description": "在20级时，你获得一个由你神圣誓言所赋予的能力。",
        "level": 20
      }
    ],
    "spellcasting": {
      "type": "prepared",
      "ability": "CHA",
      "cantripsKnown": [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      "spellSlots": [
        [
          0,
          0,
          0,
          0,
          0
        ],
        [
          2,
          0,
          0,
          0,
          0
        ],
        [
          3,
          0,
          0,
          0,
          0
        ],
        [
          3,
          0,
          0,
          0,
          0
        ],
        [
          4,
          2,
          0,
          0,
          0
        ],
        [
          4,
          2,
          0,
          0,
          0
        ],
        [
          4,
          3,
          0,
          0,
          0
        ],
        [
          4,
          3,
          0,
          0,
          0
        ],
        [
          4,
          3,
          2,
          0,
          0
        ],
        [
          4,
          3,
          2,
          0,
          0
        ],
        [
          4,
          3,
          3,
          0,
          0
        ],
        [
          4,
          3,
          3,
          0,
          0
        ],
        [
          4,
          3,
          3,
          1,
          0
        ],
        [
          4,
          3,
          3,
          1,
          0
        ],
        [
          4,
          3,
          3,
          2,
          0
        ],
        [
          4,
          3,
          3,
          2,
          0
        ],
        [
          4,
          3,
          3,
          3,
          1
        ],
        [
          4,
          3,
          3,
          3,
          1
        ],
        [
          4,
          3,
          3,
          3,
          2
        ],
        [
          4,
          3,
          3,
          3,
          2
        ]
      ],
      "spellList": "paladin"
    },
    "subclassAvailableAtLevel": 3,
    "subclasses": [
      {
        "id": "devotion",
        "name": "奉献之誓",
        "description": "奉献之誓约束着圣武士遵从正义、美德、和秩序中最崇高的理念。那些立下此圣誓的圣武士们有时又被称作\"骑兵\"、\"白骑士\"或\"圣战士\"。",
        "traits": [
          {
            "name": "引导神力：至圣武器",
            "description": "以一个动作，你可以将正能量注入一把你正持握的武器。在1分钟内，你在使用该武器进行的攻击检定中加入你的魅力调整值。该武器同时散发出20尺半径的明亮光照和微光光照。",
            "level": 3
          },
          {
            "name": "引导神力：驱散不洁者",
            "description": "以一个动作，你展现你的圣徽并说出一句斥责邪魔和不死生物的祷词。每个距离你30尺内且可以看见或听见你的邪魔和不死生物必须进行一次感知豁免。若豁免失败，该生物将被驱散长达1分钟或直到它受到伤害。",
            "level": 3
          },
          {
            "name": "奉献灵光",
            "description": "你和距离你10尺内的友善生物都不会在你意识清醒的时候被魅惑。从18级开始，这个灵光的范围将增加至30尺。",
            "level": 7
          },
          {
            "name": "纯净之魂",
            "description": "你将永远处于防护善恶法术的效果影响。",
            "level": 15
          },
          {
            "name": "神圣光轮",
            "description": "以一个动作，你可以放射出一道日光灵光。在1分钟内，你将散发出30尺半径的明亮光照和微光光照。每当一个敌对生物在此明亮光照的范围内开始它的回合，该生物将受到10点光耀伤害。此外，在持续期间内，你在对抗由邪魔或不死生物所施放法术的豁免检定中具有优势。",
            "level": 20
          }
        ],
        "spells": [
          {
            "level": 3,
            "spellId": "protection-from-evil-and-good",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "sanctuary",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "lesser-restoration",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "zone-of-truth",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "beacon-of-hope",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "dispel-magic",
            "alwaysPrepared": true
          },
          {
            "level": 13,
            "spellId": "freedom-of-movement",
            "alwaysPrepared": true
          },
          {
            "level": 13,
            "spellId": "guardian-of-faith",
            "alwaysPrepared": true
          },
          {
            "level": 17,
            "spellId": "commune",
            "alwaysPrepared": true
          },
          {
            "level": 17,
            "spellId": "flame-strike",
            "alwaysPrepared": true
          }
        ],
        "source": "phb"
      },
      {
        "id": "vengeance",
        "name": "复仇之誓",
        "description": "复仇之誓是个严肃的承诺，立誓于惩罚那些犯下严重罪行之人。当邪恶势力屠杀无辜的百姓，或当巨龙横行于乡野，圣武士们就会出现，并立下复仇之誓以彰显他们拨乱反正的决心。",
        "traits": [
          {
            "name": "引导神力：誓绝仇敌",
            "description": "以一个动作，你展现你的圣徽并说出斥责的祷词。选择一个距离你60尺内且你所能看见的生物。该生物必须进行一次感知豁免，除非它免疫于恐惧。邪魔和不死生物将在此豁免检定中具有劣势。若豁免失败，该生物将陷入恐惧长达1分钟，或直到它受到任何伤害，此时移动速度归零。若豁免成功，该生物的移动速度被减半长达1分钟，或直到该生物受到任何伤害。",
            "level": 3
          },
          {
            "name": "引导神力：憎恨誓言",
            "description": "以一个附赠动作，你可以使用你的引导神力，对一个距离你10尺内且你所能看见的生物立下憎恨誓言。你对该生物所进行的攻击检定将具有优势，持续1分钟，或直到它的生命值归零或陷入昏迷状态。",
            "level": 3
          },
          {
            "name": "无尽复仇",
            "description": "你的超常专注将协助你阻止敌人撤退。当你以一次借机攻击命中一个生物时，你可以在攻击之后作为该反应的一部份，立刻移动最多等同于你移动速度一半的距离。这个移动并不会引发借机攻击。",
            "level": 7
          },
          {
            "name": "报复之魂",
            "description": "你立下憎恨誓言时所带有的权威将赋予你更强的力量以对抗你的敌人。当一个处于你憎恨誓言效果下的生物进行一次攻击，若该生物处于你的近战武器攻击范围内，你可以使用你的反应以对它进行一次近战武器攻击。",
            "level": 15
          },
          {
            "name": "复仇天使",
            "description": "你可以变作天使般复仇者的型态。使用你的动作，你将经历这个变化过程。在接下来1小时内，你将散发出30尺半径的威吓灵光，并且背上长出双翼，获得60尺的飞行速度。",
            "level": 20
          }
        ],
        "spells": [
          {
            "level": 3,
            "spellId": "bane",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "hunters-mark",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "hold-person",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "misty-step",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "haste",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "protection-from-energy",
            "alwaysPrepared": true
          },
          {
            "level": 13,
            "spellId": "banishment",
            "alwaysPrepared": true
          },
          {
            "level": 13,
            "spellId": "dimension-door",
            "alwaysPrepared": true
          },
          {
            "level": 17,
            "spellId": "hold-monster",
            "alwaysPrepared": true
          },
          {
            "level": 17,
            "spellId": "scrying",
            "alwaysPrepared": true
          }
        ],
        "source": "phb"
      },
      {
        "id": "oathbreaker",
        "name": "破誓者",
        "description": "破誓者是那些主动背弃或违背神圣誓言，堕入黑暗的圣武士。追求正义的美德已荡然无存，他们为复仇与野心所吞噬，转化成受不可遏制的黑暗力量驱使的极恶邪物。",
        "traits": [
          {
            "name": "破誓者引导神力：控制亡灵",
            "description": "以一个动作，该圣武士指定其身边30尺内一个他能看见的不死生物。该目标必须进程一次感知豁免。豁免失败时，该目标必须在随后的24小时里遵从该圣武士的命令，或者直至该圣武士在此使用该引导神力选项为止。挑战等级等于或高于该圣武士等级的不死生物免疫该效应。",
            "level": 3
          },
          {
            "name": "破誓者引导神力：恐怖显现",
            "description": "以一个动作，该圣武士引导最黑暗的情感并将其凝聚爆发为一场魔法的胁迫之息。该圣武士周边30尺内，其指定的每个能看到该圣武士的生物必须进行一次感知豁免。豁免失败的目标将陷入1分钟对该圣武士恐慌的状态。",
            "level": 3
          },
          {
            "name": "憎恨灵光",
            "description": "该圣武士本身，以及其身边10尺内的所有邪魔和不死生物，都将获的与该圣武士魅力调整值相同(至少为+1)的近战武器伤害骰加值。从18级开始，该灵光的覆盖范围增加至30尺。",
            "level": 7
          },
          {
            "name": "超然抗性",
            "description": "第15级时，该圣武士获得对非魔法武器的钝击、刺穿、挥砍伤害的抗性。",
            "level": 15
          },
          {
            "name": "恐惧之王",
            "description": "第20级时，以一个动作，该圣武士可以使自己在1分钟内环绕于阴郁的灵光中。任何受该圣武士恐慌的敌人在该灵光内开始其自己回合时将受到4d10的心灵伤害。依赖视觉的生物对笼罩于该幽影中的生物发动攻击检定时具有劣势。",
            "level": 20
          }
        ],
        "spells": [
          {
            "level": 3,
            "spellId": "hellish-rebuke",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "inflict-wounds",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "crown-of-madness",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "darkness",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "animate-dead",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "bestow-curse",
            "alwaysPrepared": true
          },
          {
            "level": 13,
            "spellId": "blight",
            "alwaysPrepared": true
          },
          {
            "level": 13,
            "spellId": "confusion",
            "alwaysPrepared": true
          },
          {
            "level": 17,
            "spellId": "contagion",
            "alwaysPrepared": true
          },
          {
            "level": 17,
            "spellId": "dominate-person",
            "alwaysPrepared": true
          }
        ],
        "source": "dmg"
      },
      {
        "id": "ancients",
        "name": "远古之誓",
        "description": "远古之誓就和精灵种族以及德鲁伊的教仪一样古老。那些立下此圣誓的圣武士们有时又被称作\"妖精骑士\"、\"绿之骑士\"或\"角冠骑士\"，他们为了保护世界上的生命和光明而战。",
        "traits": [
          {
            "name": "引导神力：自然之怒",
            "description": "你可以使用你的引导神力并唤起原初之力以捕缚一个敌人。以一个动作，你可以让灵体藤蔓生长而出并缠向一个距离你10尺内，且你所能看见的生物。该生物必须成功通过一次力量或敏捷豁免，否则陷入束缚状态。",
            "level": 3
          },
          {
            "name": "引导神力：驱散无信者",
            "description": "展现圣徽，斥责精类和邪魔，感知豁免失败将被驱散1分钟。",
            "level": 3
          },
          {
            "name": "防护灵光",
            "description": "你和距离你10尺内的友善生物都将获得对法术伤害的抗性。18级范围增加至30尺。",
            "level": 7
          },
          {
            "name": "不朽卫士",
            "description": "当你的生命值被归零且没有被当场杀死时，你可以选择改为将生命值减少至1。一旦你使用此能力，直到你完成一次长休之前你都不能再使用它。此外，你将免受任何衰老的弊害。",
            "level": 15
          },
          {
            "name": "远古斗士",
            "description": "你可以变作大自然远古力量化身的型态。在接下来1分钟内，在你的每个回合开始时回复10点生命值。每当你施放一个施法时间为一个动作的圣武士法术，你可以改为以附赠动作施放。距离你10尺内的敌对生物对抗你法术的豁免检定有劣势。",
            "level": 20
          }
        ],
        "spells": [
          {
            "level": 3,
            "spellId": "ensnaring-strike",
            "alwaysPrepared": true
          },
          {
            "level": 3,
            "spellId": "speak-with-animals",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "moonbeam",
            "alwaysPrepared": true
          },
          {
            "level": 5,
            "spellId": "misty-step",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "plant-growth",
            "alwaysPrepared": true
          },
          {
            "level": 9,
            "spellId": "protection-from-energy",
            "alwaysPrepared": true
          },
          {
            "level": 13,
            "spellId": "ice-storm",
            "alwaysPrepared": true
          },
          {
            "level": 13,
            "spellId": "stoneskin",
            "alwaysPrepared": true
          },
          {
            "level": 17,
            "spellId": "commune-with-nature",
            "alwaysPrepared": true
          },
          {
            "level": 17,
            "spellId": "tree-stride",
            "alwaysPrepared": true
          }
        ],
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "STR",
          "min": 13
        },
        {
          "ability": "CHA",
          "min": 13
        }
      ],
      "proficiencies": {
        "armor": [
          "轻甲",
          "中甲",
          "盾牌"
        ],
        "weapons": [
          "简易武器",
          "军用武器"
        ]
      }
    }
  },
  {
    "id": "ranger",
    "name": "游侠",
    "description": "隐秘书林和荒野之中，追迹与斩杀边缘怪物的猎手。他们精通利用环境，甚至与各种野兽结为强大盟侣，同时也能引导荒野与自然的魔力进行攻击或为战斗提供战略辅助。",
    "hitDie": 10,
    "primaryAbility": [
      "DEX",
      "WIS"
    ],
    "saves": [
      "STR",
      "DEX"
    ],
    "armorProficiencies": [
      "轻甲",
      "中甲",
      "盾牌"
    ],
    "weaponProficiencies": [
      "简易武器",
      "军用武器"
    ],
    "toolProficiencies": [],
    "skills": {
      "count": 3,
      "choices": [
        "驯兽",
        "运动",
        "洞悉",
        "调查",
        "自然",
        "察觉",
        "隐匿",
        "生存"
      ]
    },
    "startingEquipment": [
      "(a)一件鳞甲 或 (b)一件皮甲",
      "(a)二把短剑 或 (b)二把简易近战武器",
      "(a)一套地城探险家套装 或 (b)一套探索者套装",
      "一把长弓和一个装有20支箭的箭袋"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "ranger-skills",
            "name": "选择 3 个技能熟练",
            "chooseNumber": 3,
            "options": [
              {
                "id": "animalHandling",
                "name": "驯兽"
              },
              {
                "id": "athletics",
                "name": "运动"
              },
              {
                "id": "insight",
                "name": "洞悉"
              },
              {
                "id": "investigation",
                "name": "调查"
              },
              {
                "id": "nature",
                "name": "自然"
              },
              {
                "id": "perception",
                "name": "察觉"
              },
              {
                "id": "stealth",
                "name": "隐匿"
              },
              {
                "id": "survival",
                "name": "生存"
              }
            ]
          },
          {
            "id": "ranger-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一件鳞甲"
              },
              {
                "id": "opt-1",
                "name": "(b)一件皮甲"
              }
            ]
          },
          {
            "id": "ranger-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)二把短剑"
              },
              {
                "id": "opt-1",
                "name": "(b)二把简易近战武器"
              }
            ]
          },
          {
            "id": "ranger-equip-2",
            "name": "装备组 3 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一套地城探险家套装"
              },
              {
                "id": "opt-1",
                "name": "(b)一套探索者套装"
              }
            ]
          },
          {
            "id": "ranger-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "宿敌",
        "description": "从1级开始，你在对一个特定类型的敌人的研究、追迹、狩猎、和甚至交谈上已相当具备充足的经验。选择一个宿敌类型。你在用于追踪你宿敌的感知（生存）检定、以及用以回忆关于它们情报的智力检定中具有优势。",
        "level": 1,
        "choices": [
          {
            "id": "ranger-favored-enemy-1",
            "name": "选择第一宿敌",
            "chooseNumber": 1,
            "options": [
              {
                "id": "aberration",
                "name": "异怪"
              },
              {
                "id": "beast",
                "name": "野兽"
              },
              {
                "id": "celestial",
                "name": "天界生物"
              },
              {
                "id": "construct",
                "name": "构装体"
              },
              {
                "id": "dragon",
                "name": "龙"
              },
              {
                "id": "elemental",
                "name": "元素"
              },
              {
                "id": "fey",
                "name": "精类"
              },
              {
                "id": "fiend",
                "name": "邪魔"
              },
              {
                "id": "giant",
                "name": "巨人"
              },
              {
                "id": "monstrosity",
                "name": "怪兽"
              },
              {
                "id": "ooze",
                "name": "泥怪"
              },
              {
                "id": "plant",
                "name": "植物"
              },
              {
                "id": "undead",
                "name": "不死生物"
              },
              {
                "id": "humanoid-2",
                "name": "二种指定类人生物"
              }
            ]
          }
        ]
      },
      {
        "name": "自然探索者",
        "description": "你特别熟悉于一种自然环境，且熟稔在这类区域中旅行和生存的方式。选择一种偏好环境。你在该环境获得旅行优势且部分检定双倍熟练",
        "level": 1,
        "choices": [
          {
            "id": "ranger-favored-terrain-1",
            "name": "选择第一偏好环境",
            "chooseNumber": 1,
            "options": [
              {
                "id": "arctic",
                "name": "极地"
              },
              {
                "id": "coast",
                "name": "海岸"
              },
              {
                "id": "desert",
                "name": "沙漠"
              },
              {
                "id": "forest",
                "name": "森林"
              },
              {
                "id": "grassland",
                "name": "草地"
              },
              {
                "id": "mountain",
                "name": "高山"
              },
              {
                "id": "swamp",
                "name": "沼泽"
              },
              {
                "id": "underdark",
                "name": "幽暗地域"
              }
            ]
          }
        ]
      },
      {
        "name": "战斗风格",
        "description": "在2级时，你采用一种特殊的战斗风格以作为你的专业。",
        "level": 2,
        "choices": [
          {
            "id": "ranger-fighting-style",
            "name": "选择一种战斗风格",
            "chooseNumber": 1,
            "options": [
              {
                "id": "archery",
                "name": "弓道",
                "description": "远程攻击+2。"
              },
              {
                "id": "defense",
                "name": "防御",
                "description": "穿甲AC+1。"
              },
              {
                "id": "dueling",
                "name": "决斗",
                "description": "单手持武伤害+2。"
              },
              {
                "id": "twf",
                "name": "双武器战斗",
                "description": "第二次攻击加属性调整值。"
              }
            ]
          }
        ]
      },
      {
        "name": "施法",
        "description": "在你升至2级时，你学会如同德鲁伊的方式使用大自然的精粹以施放法术。已知法术数量见表，感知是你的施法关键属性。",
        "level": 2
      },
      {
        "name": "游侠范型",
        "description": "在3级时，你从可选范型列表中选择一种你致力于达成的范型。你的选择将在3级、7级、11级、和15级时赋予你新的能力。",
        "level": 3
      },
      {
        "name": "原初意识",
        "description": "从3级开始，你可以使用你的动作并消耗一个游侠法术位以集中你的意识于你周遭的区域。在为你所消耗法术位的每环阶1分钟内，你可以感知下列类型的生物是否存在于距离你1里内的区域：异怪、天界生物、龙、元素、精类、邪魔、和不死生物。",
        "level": 3
      },
      {
        "name": "属性值提升",
        "description": "4级、8级、12级、16级、19级时获得属性值提升。",
        "level": 4,
        "choices": [
          {
            "id": "ranger-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "额外攻击",
        "description": "从5级开始，每当你在自己回合执行攻击动作时，你可以发动两次攻击，而非一次。",
        "level": 5
      },
      {
        "name": "宿敌和自然探索者强化",
        "description": "在6级时，你获得一种额外的偏好环境以及一种额外的宿敌。",
        "level": 6
      },
      {
        "name": "游侠范型能力",
        "description": "在7级时，你获得一个由你游侠范型所赋予的能力。",
        "level": 7
      },
      {
        "name": "大地行者",
        "description": "从8级开始，移动穿过非魔法的困难地形并不会花费你额外的移动速度。你也可以穿越非魔法植物而不会被它们减缓速度或造成伤害。在对抗魔法植物造成的阻碍移动效果时豁免具有优势。",
        "level": 8
      },
      {
        "name": "避人耳目",
        "description": "从10级开始，你可以花费1分钟的时间为自己创造一个伪装。通过将自己贴合于一个至少与你一样大的固体表面上，你就在敏捷（隐匿）检定中获得+10的加值。",
        "level": 10
      },
      {
        "name": "自然探索者强化",
        "description": "在10级时，你获得一种额外的偏好环境。",
        "level": 10
      },
      {
        "name": "游侠范型能力",
        "description": "在11级时，你获得一个由你游侠范型所赋予的能力。",
        "level": 11
      },
      {
        "name": "无踪步",
        "description": "从14级开始，你可以在你的回合以一个附赠动作采取躲藏动作。同时，你不会被非魔法的手段追踪，除非你选择留下踪迹。",
        "level": 14
      },
      {
        "name": "宿敌强化",
        "description": "在14级时，你选择一种额外的宿敌以及一种关联语言。",
        "level": 14
      },
      {
        "name": "游侠范型能力",
        "description": "在15级时，你获得一个由你游侠范型所赋予的能力。",
        "level": 15
      },
      {
        "name": "野性感官",
        "description": "在18级时，你获得超自然的感官以帮助你对抗看不见的生物。当你攻击一个你看不见的生物时，你并不会在攻击检定中承受劣势。同时，只要该生物没有躲藏于你，且你不处于目盲或耳聋状态，则你也能察觉到任何距离你30尺内隐形生物的位置。",
        "level": 18
      },
      {
        "name": "众敌屠戮",
        "description": "在20级时，你成为了一名针对你敌人的无双猎手。在你的每个回合一次，你可以将你的感知调整值加到你对你其中一个宿敌所进行的攻击检定或伤害骰中。",
        "level": 20
      }
    ],
    "spellcasting": {
      "type": "known",
      "ability": "WIS",
      "cantripsKnown": [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      "spellsKnown": [
        0,
        2,
        3,
        3,
        4,
        4,
        5,
        5,
        6,
        6,
        7,
        7,
        8,
        8,
        9,
        9,
        10,
        10,
        11,
        11
      ],
      "spellSlots": [
        [
          0,
          0,
          0,
          0,
          0
        ],
        [
          2,
          0,
          0,
          0,
          0
        ],
        [
          3,
          0,
          0,
          0,
          0
        ],
        [
          3,
          0,
          0,
          0,
          0
        ],
        [
          4,
          2,
          0,
          0,
          0
        ],
        [
          4,
          2,
          0,
          0,
          0
        ],
        [
          4,
          3,
          0,
          0,
          0
        ],
        [
          4,
          3,
          0,
          0,
          0
        ],
        [
          4,
          3,
          2,
          0,
          0
        ],
        [
          4,
          3,
          2,
          0,
          0
        ],
        [
          4,
          3,
          3,
          0,
          0
        ],
        [
          4,
          3,
          3,
          0,
          0
        ],
        [
          4,
          3,
          3,
          1,
          0
        ],
        [
          4,
          3,
          3,
          1,
          0
        ],
        [
          4,
          3,
          3,
          2,
          0
        ],
        [
          4,
          3,
          3,
          2,
          0
        ],
        [
          4,
          3,
          3,
          3,
          1
        ],
        [
          4,
          3,
          3,
          3,
          1
        ],
        [
          4,
          3,
          3,
          3,
          2
        ],
        [
          4,
          3,
          3,
          3,
          2
        ]
      ],
      "spellList": "ranger"
    },
    "subclassAvailableAtLevel": 3,
    "subclasses": [
      {
        "id": "hunter",
        "name": "猎人",
        "description": "仿效猎人范型意味着接受你作为文明和荒野恐惧间壁垒的身分。随着你行走在猎人的道途上，你学会对抗迎面而来威胁的专业技巧。",
        "traits": [
          {
            "name": "狩者猎物",
            "description": "你获得下列其中一个你所选择的能力：巨怪猎者（对生命值未满的生物攻击额外造成1d8伤害）、巨人杀手（当大型或更大生物攻击你后，可用反应对其进行一次攻击）或灭族者（每回合一次，攻击后可对临近另一目标再次攻击）。",
            "level": 3,
        "choices": [
          {
            "id": "hunter-prey",
            "name": "选择狩者猎物",
            "chooseNumber": 1,
            "options": [
              { "id": "colossus-slayer", "name": "巨怪猎者", "description": "每回合一次，当你以武器攻击命中一个生命值处于最大值以下的生物时，造成额外1d8伤害。" },
              { "id": "giant-killer", "name": "巨人杀手", "description": "当一个大型或更大体型的生物在距离你5尺内以一次攻击命中或未命中你，你可以使用反应对该生物进行一次攻击。" },
              { "id": "horde-breaker", "name": "灭族者", "description": "每回合一次，当你进行一次武器攻击，你可以使用相同武器对另一个与原目标距离5尺内且在武器射程内的生物进行一次额外攻击。" }
            ]
          }
        ]
          },
          {
            "name": "防御性战术",
            "description": "你获得下列其中一个能力：逃离众敌（借机攻击劣势）、防御多重攻击（被命中后当回合AC+4）或钢铁意志（对抗恐惧豁免优势）。",
            "level": 7,
        "choices": [
          {
            "id": "defensive-tactics",
            "name": "选择防御性战术",
            "chooseNumber": 1,
            "options": [
              { "id": "escape-the-horde", "name": "逃离众敌", "description": "对你进行的借机攻击具有劣势。" },
              { "id": "multiattack-defense", "name": "防御多重攻击", "description": "当一个生物以一次攻击命中你，此回合接下来该生物对你进行的所有攻击检定中，你的AC获得+4加值。" },
              { "id": "steel-will", "name": "钢铁意志", "description": "对抗惊恐（恐惧）状态的豁免具有优势。" }
            ]
          }
        ]
          },
          {
            "name": "多重攻击",
            "description": "你获得箭雨（对射程内一点周围10尺所有生物进行远程攻击）或剑刃风暴（对5尺内任意生物进行近战攻击）。",
            "level": 11,
        "choices": [
          {
            "id": "multiattack",
            "name": "选择多重攻击",
            "chooseNumber": 1,
            "options": [
              { "id": "volley", "name": "箭雨", "description": "使用一个动作，对你远程武器射程内的一个光秃点周围10尺内任何数量生物进行远程攻击。" },
              { "id": "whirlwind", "name": "剑刃风暴", "description": "使用一个动作，对你触及范围5尺内的任何数量生物进行近战攻击。" }
            ]
          }
        ]
          },
          {
            "name": "卓越猎人防御",
            "description": "你获得反射闪避（敏捷豁免成功不受伤害）、逆潮而立（近战攻击失手时强迫攻击者攻击另一生物）或直觉闪避（被命中时用反应减半伤害）。",
            "level": 15,
        "choices": [
          {
            "id": "superior-hunters-defense",
            "name": "选择卓越猎人防御",
            "chooseNumber": 1,
            "options": [
              { "id": "evasion", "name": "躲避", "description": "当你受到需要敏捷豁免只受到一半伤害的效果时，若成功则完全不受伤害，若失败则只受一半伤害。" },
              { "id": "stand-against-the-tide", "name": "挺身抗潮", "description": "当一个对立生物在近战中未命中你，你可以使用反应使该攻击去命中另一个距离你5尺内且你所能看见的生物（除攻击者外）。" },
              { "id": "uncanny-dodge", "name": "直觉闪避", "description": "当一个你所能看见的攻击者以攻击命中你，可以使用反应使该攻击伤害减半。" }
            ]
          }
        ]
          }
        ],
        "source": "phb"
      },
      {
        "id": "beast-master",
        "name": "兽王",
        "description": "兽王范型体现了文明种族和自然野兽之间的情谊。团结一致，野兽和游侠将共同对抗威胁着文明和自然世界的可怕敌人。",
        "traits": [
          {
            "name": "游侠动物伙伴",
            "description": "你获得一个动物伙伴，它将陪伴你一起冒险。选择一个体型不超过中型，挑战等级为1/4或更低的野兽。将你的熟练加值加入它的AC、攻击检定、伤害骰以及它所熟练的豁免检定和技能中。它的生命值最大值为它正常值或你游侠等级的四倍取高。你可以口头命令它移动，或用动作命令它攻击等。",
            "level": 3
          },
          {
            "name": "超绝训练",
            "description": "只要你的动物伙伴没有攻击，你可以使用附赠动作命令它采取疾走、撤离或协助动作。此外，它的攻击在克服非魔法攻击和伤害的抗性与免疫时被视为魔法攻击。",
            "level": 7
          },
          {
            "name": "野性狂怒",
            "description": "当你命令你的动物伙伴采取攻击动作时，该野兽可以进行二次攻击，或采取它拥有的多重攻击动作。",
            "level": 11
          },
          {
            "name": "法术共享",
            "description": "当你施放以你自己为目标的法术时，若你的动物伙伴距离你30尺内，你也可以让它受到该法术的影响。",
            "level": 15
          }
        ],
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "DEX",
          "min": 13
        },
        {
          "ability": "WIS",
          "min": 13
        }
      ],
      "proficiencies": {
        "armor": [
          "轻甲",
          "中甲",
          "盾牌"
        ],
        "weapons": [
          "简易武器",
          "军用武器"
        ],
        "skills": {
          "count": 1,
          "choices": [
            "驯兽",
            "运动",
            "洞悉",
            "调查",
            "自然",
            "察觉",
            "隐匿",
            "生存"
          ]
        }
      }
    }
  },
  {
    "id": "rogue",
    "name": "游荡者",
    "description": "以潜行、偷袭和技巧战胜对手的恶棍们。他们最擅长在阴影中行动，找到敌人的弱点刺出致命伤，此外也能在危机中轻松拆解陷阱，解开复杂的锁具，甚至言辞欺诈他人。",
    "hitDie": 8,
    "primaryAbility": [
      "DEX"
    ],
    "saves": [
      "DEX",
      "INT"
    ],
    "armorProficiencies": [
      "轻甲"
    ],
    "weaponProficiencies": [
      "简易武器",
      "手弩",
      "长剑",
      "刺剑",
      "短剑"
    ],
    "toolProficiencies": [
      "盗贼工具"
    ],
    "skills": {
      "count": 4,
      "choices": [
        "特技",
        "运动",
        "欺瞒",
        "洞悉",
        "威吓",
        "调查",
        "察觉",
        "表演",
        "说服",
        "巧手",
        "隐匿"
      ]
    },
    "startingEquipment": [
      "(a)一把刺剑 或 (b)一把短剑",
      "(a)一把短弓和一个装有20支箭的箭袋 或 (b)一把短剑",
      "(a)一套窃贼套装, (b)一套地城探险家套装, 或 (c)一套探索者套装",
      "一件皮甲、二把匕首、和一套盗贼工具"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "rogue-skills",
            "name": "选择 4 个技能熟练",
            "chooseNumber": 4,
            "options": [
              {
                "id": "acrobatics",
                "name": "特技"
              },
              {
                "id": "athletics",
                "name": "运动"
              },
              {
                "id": "deception",
                "name": "欺瞒"
              },
              {
                "id": "insight",
                "name": "洞悉"
              },
              {
                "id": "intimidation",
                "name": "威吓"
              },
              {
                "id": "investigation",
                "name": "调查"
              },
              {
                "id": "perception",
                "name": "察觉"
              },
              {
                "id": "performance",
                "name": "表演"
              },
              {
                "id": "persuasion",
                "name": "说服"
              },
              {
                "id": "sleightOfHand",
                "name": "巧手"
              },
              {
                "id": "stealth",
                "name": "隐匿"
              }
            ]
          },
          {
            "id": "rogue-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把刺剑"
              },
              {
                "id": "opt-1",
                "name": "(b)一把短剑"
              }
            ]
          },
          {
            "id": "rogue-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把短弓和一个装有20支箭的箭袋"
              },
              {
                "id": "opt-1",
                "name": "(b)一把短剑"
              }
            ]
          },
          {
            "id": "rogue-equip-2",
            "name": "装备组 3 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一套窃贼套装"
              },
              {
                "id": "opt-1",
                "name": "(b)一套地城探险家套装"
              },
              {
                "id": "opt-2",
                "name": "(c)一套探索者套装"
              }
            ]
          },
          {
            "id": "rogue-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "专精",
        "description": "在1级时，选择二个你的技能熟练，或一个你的技能熟练和你对盗贼工具的熟练。你的熟练加值在使用所选熟练项所进行的任何属性检定中变为两倍。在6级时，你可以再选择另外两个熟练项以获得这个好处。",
        "level": 1,
        "choices": [
          {
            "id": "rogue-expertise-1",
            "name": "选择两项熟练获得专精（需已拥有熟练）",
            "chooseNumber": 2,
            "dynamic": "expertise"
          }
        ]
      },
      {
        "name": "偷袭",
        "description": "从1级开始，你知道如何利用敌人的分心以做出巧妙的攻击。每个回合一次，若你在攻击检定中具有优势，则你可以对一个你命中的生物造成额外的1d6伤害。该攻击必须使用一把灵巧或远程武器。若有另一个敌对生物在目标5尺内且未无力，你不需要优势也可发动。伤害随等级增加。",
        "level": 1
      },
      {
        "name": "盗贼黑话",
        "description": "在你的游荡者训练中，你学会了盗贼黑话，一种混杂了方言、黑话、以及暗码的秘密语言，并让你得以将消息隐藏在看似寻常的对话中。此外，你也理解一套用以传达简短单纯消息的秘密记号和符号。",
        "level": 1
      },
      {
        "name": "灵巧动作",
        "description": "从2级开始，你的机智和灵巧让你得以快速地移动和行动。你可以在战斗中每个你的回合采取一个附赠动作。这个附赠动作只能被用于采取疾走、撤离或躲藏。",
        "level": 2
      },
      {
        "name": "游荡者范型",
        "description": "在3级时，你从可选范型列表中选择一种你在行使你游荡者能力时仿效的范型。你的选择将在3级、9级、13级、和17级时赋予你新的能力。",
        "level": 3
      },
      {
        "name": "属性值提升",
        "description": "4级、8级、10级、12级、16级、19级时获得属性值提升。",
        "level": 4,
        "choices": [
          {
            "id": "rogue-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "直觉闪避",
        "description": "从5级开始，当一个你所能看见的攻击者使用一次攻击命中你，你可以使用你的反应以减半该次攻击对你的伤害。",
        "level": 5
      },
      {
        "name": "反射闪避",
        "description": "从7级开始，你可以灵活地躲开某些范围效果。当你成为一个允许你进行敏捷豁免以仅承受一半伤害的效果的目标时，你改为在豁免成功时不受任何伤害，且在豁免失败时仅承受一半伤害。",
        "level": 7
      },
      {
        "name": "游荡者范型能力",
        "description": "在9级时，你获得一个由你游荡者范型所赋予的能力。",
        "level": 9
      },
      {
        "name": "可靠才能",
        "description": "从11级起，你已将你所选的游荡者范型的技能琢磨到臻近完美。每当你进行一个允许你加入你熟练加值的属性检定，你可以将其d20骰出9或以下的掷骰结果视为10。",
        "level": 11
      },
      {
        "name": "游荡者范型能力",
        "description": "在13级时，你获得一个由你游荡者范型所赋予的能力。",
        "level": 13
      },
      {
        "name": "盲感",
        "description": "从14级开始，若你能够听见，则你能够察觉到任何距离你10尺内躲藏起来或隐形的生物所在的位置。",
        "level": 14
      },
      {
        "name": "灵活心智",
        "description": "从15级起，你养成了强大的心智力量。你获得对感知豁免的熟练。",
        "level": 15
      },
      {
        "name": "游荡者范型能力",
        "description": "在17级时，你获得一个由你游荡者范型所赋予的能力。",
        "level": 17
      },
      {
        "name": "捉摸不定",
        "description": "从18级开始，你是如此的难以捕捉以至于攻击者很少有办法在对付你时取得优势。当你不处于无力状态时，对你进行的所有攻击检定都不具有优势。",
        "level": 18
      },
      {
        "name": "幸运一击",
        "description": "在20级时，你有着在你需要的时候成功的神奇诀窍。若你对一个范围内目标的攻击失手，你可以将该次攻击从失手改成命中。或者，若你在一次属性检定中失败，你可以将其d20的掷骰结果视作骰出了20。短休或长休后恢复。",
        "level": 20
      }
    ],
    "subclassAvailableAtLevel": 3,
    "subclasses": [
      {
        "id": "thief",
        "name": "窃贼",
        "description": "你磨练你在盗窃技艺上的技巧。小偷、强盗、扒手、和其他罪犯通常会遵从这个范型。",
        "traits": [
          {
            "name": "快手",
            "description": "你可以使用你灵巧动作能力所赋予的附赠动作来进行一次敏捷（巧手）检定、使用你的盗贼工具以解除陷阱或开锁、或采取使用物件动作。",
            "level": 3
          },
          {
            "name": "梁上君子",
            "description": "你获得能攀爬的比原本更快的能力；攀爬不再需要花费你额外的移动速度。此外，当你进行助跑跳远时，你可以跨越的距离将增加等同于你敏捷调整值的尺数。",
            "level": 3
          },
          {
            "name": "卓越潜行",
            "description": "若你移动不超过你移动速度一半的距离，你在同个回合所进行的敏捷（隐匿）检定中具有优势。",
            "level": 9
          },
          {
            "name": "使用魔法设备",
            "description": "你学会了足够多关于魔法如何运作的知识，并让你可以即兴使用那些不是设计给你使用的物品。你在使用魔法物品时忽略它所有的职业、种族、和等级需求。",
            "level": 13
          },
          {
            "name": "窃贼反射",
            "description": "你已成为了伏击与快速逃离危险的行家。你在任何战斗的第一轮中可以进行二个回合。你在你正常的先攻值进行你的第一个回合，并在你先攻值减10的顺序进行你的第二个回合。",
            "level": 17
          }
        ],
        "source": "phb"
      },
      {
        "id": "assassin",
        "name": "刺客",
        "description": "你专注你的训练于残忍冷酷的死亡艺术。那些遵从这个范型的人们有各式各样：雇佣杀手、间谍、赏金猎人。",
        "traits": [
          {
            "name": "额外熟练",
            "description": "你获得易容工具和制毒工具的熟练。",
            "level": 3
          },
          {
            "name": "刺杀",
            "description": "你在先发制人的时刻是最致命的。你对任何在战斗中尚未行动过的生物所进行的攻击检定具有优势。此外，任何你命中被突袭生物的攻击都是重击。",
            "level": 3
          },
          {
            "name": "专业渗透",
            "description": "你可以为自己创造出可靠的假身分。你必须花费七天的时间和25金币以为该身分编造历史纪录、职业、以及人际关系。",
            "level": 9
          },
          {
            "name": "冒充者",
            "description": "你获得准确模仿其他人说话、书写、和行为举止的能力。你必须花费至少三个小时的时间以研究该人物行为中的这三个要素。",
            "level": 13
          },
          {
            "name": "死亡一击",
            "description": "你成为了让人在瞬间死亡的宗师。当你攻击并命中一个被突袭的生物，它必须进行一次体质豁免。若豁免失败，则你对该生物造成的伤害将变为二倍。",
            "level": 17
          }
        ],
        "source": "phb"
      },
      {
        "id": "arcane-trickster",
        "name": "诡术师",
        "description": "有些游荡者利用魔法增进了他们精心琢磨的隐匿和灵动技巧，学习惑控和幻术系的诡术。",
        "traits": [
          {
            "name": "施法",
            "description": "当你升至3级时，你获得了施放法术的能力。戏法：你学会三个戏法：法师之手、和另外二个你从法师法术列表中自选的戏法。一环或更高环的已知法术：你知晓三个从法师法术列表中自选的1环法术，其中二个必须从惑控系和幻术系法术中选择。",
            "level": 3,
            "choices": [
              {
                "id": "spells-step-cantrips",
                "name": "选择两个法师戏法（法师之手已自动获得）",
                "chooseNumber": 2,
                "dynamic": "spell",
                "spellType": "cantrip",
                "spellList": "wizard",
                "preselected": [
                  "mage-hand"
                ]
              },
              {
                "id": "spells-step-leveled",
                "name": "选择三个1环法师法术（至少两个惑控/幻术）",
                "chooseNumber": 3,
                "dynamic": "spell",
                "spellType": "known",
                "spellList": "wizard",
                "maxLevel": 1,
                "schoolRestriction": [
                  "惑控系",
                  "幻术系"
                ]
              }
            ]
          },
          {
            "name": "法师之手诈术",
            "description": "当你施放法师之手时，你可以让这只幽灵般的手掌隐形，且你可以用它来进行额外的行动：将物体放入或取出容器，使用盗贼工具开锁，且可以用附赠动作控制。",
            "level": 3
          },
          {
            "name": "魔法伏击",
            "description": "若你在对一个生物处于躲藏状态的情况下对它施放一个法术，则该生物在该回合为对抗该法术所进行的任何豁免检定都将具有劣势。",
            "level": 9
          },
          {
            "name": "万能诡术",
            "description": "你获得用你的法师之手以干扰目标的能力。以一个附赠动作指定法师之手5尺内的生物，你对该生物的攻击检定获得优势。",
            "level": 13
          },
          {
            "name": "法术窃贼",
            "description": "你获得以魔法偷走法术知识的能力。紧接在一个生物施放以你为目标或把你纳入范围的法术后，你可以使用反应强迫其豁免，失败则无效该法术对你的效果并盗取该法术，8小时内可施放。",
            "level": 17
          }
        ],
        "spells": [
          {
            "level": 0,
            "spellId": "mage-hand"
          }
        ],
        "spellcasting": {
          "type": "known",
          "ability": "INT",
          "spellList": "wizard",
          "cantripsKnown": [
            3,
            3,
            3,
            3,
            3,
            3,
            3,
            3,
            3,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            4
          ],
          "spellsKnown": [
            0,
            0,
            3,
            4,
            4,
            4,
            5,
            6,
            6,
            7,
            8,
            8,
            9,
            10,
            10,
            11,
            11,
            11,
            11,
            12
          ],
          "spellSlots": [
            [
              0,
              0,
              0,
              0
            ],
            [
              0,
              0,
              0,
              0
            ],
            [
              2,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0
            ],
            [
              4,
              3,
              2,
              0
            ],
            [
              4,
              3,
              2,
              0
            ],
            [
              4,
              3,
              2,
              0
            ],
            [
              4,
              3,
              3,
              0
            ],
            [
              4,
              3,
              3,
              0
            ],
            [
              4,
              3,
              3,
              0
            ],
            [
              4,
              3,
              3,
              1
            ],
            [
              4,
              3,
              3,
              1
            ]
          ]
        },
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "DEX",
          "min": 13
        }
      ],
      "proficiencies": {
        "armor": [
          "轻甲"
        ],
        "tools": [
          "盗贼工具"
        ],
        "skills": {
          "count": 1,
          "choices": [
            "特技",
            "运动",
            "欺瞒",
            "洞悉",
            "威吓",
            "调查",
            "察觉",
            "表演",
            "说服",
            "巧手",
            "隐匿"
          ]
        }
      }
    }
  },
  {
    "id": "sorcerer",
    "name": "术士",
    "description": "因着古老血脉、神外之神赐福或其他意外事件而天生具备超自然魔力的施法者。他们不必像研读法术书那般施法，而是凭借自我意志与天生才华让法术扭曲、狂乱与多变。",
    "hitDie": 6,
    "primaryAbility": [
      "CHA"
    ],
    "saves": [
      "CON",
      "CHA"
    ],
    "armorProficiencies": [
      "无"
    ],
    "weaponProficiencies": [
      "匕首",
      "飞镖",
      "投石索",
      "长棍",
      "轻弩"
    ],
    "toolProficiencies": [],
    "skills": {
      "count": 2,
      "choices": [
        "奥秘",
        "欺瞒",
        "洞悉",
        "威吓",
        "说服",
        "宗教"
      ]
    },
    "startingEquipment": [
      "(a)一把轻弩和20支弩矢 或 (b)任意一把简易武器",
      "(a)一个材料包 或 (b)一个奥术法器",
      "(a)一套地城探险家套装 或 (b)一套探索者套装",
      "二把匕首"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "sorcerer-skills",
            "name": "选择 2 个技能熟练",
            "chooseNumber": 2,
            "options": [
              {
                "id": "arcana",
                "name": "奥秘"
              },
              {
                "id": "deception",
                "name": "欺瞒"
              },
              {
                "id": "insight",
                "name": "洞悉"
              },
              {
                "id": "intimidation",
                "name": "威吓"
              },
              {
                "id": "persuasion",
                "name": "说服"
              },
              {
                "id": "religion",
                "name": "宗教"
              }
            ]
          },
          {
            "id": "sorcerer-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把轻弩和20支弩矢"
              },
              {
                "id": "opt-1",
                "name": "(b)任意一把简易武器"
              }
            ]
          },
          {
            "id": "sorcerer-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一个材料包"
              },
              {
                "id": "opt-1",
                "name": "(b)一个奥术法器"
              }
            ]
          },
          {
            "id": "sorcerer-equip-2",
            "name": "装备组 3 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一套地城探险家套装"
              },
              {
                "id": "opt-1",
                "name": "(b)一套探索者套装"
              }
            ]
          },
          {
            "id": "sorcerer-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "施法",
        "description": "过去的一个事件，或者你双亲或先祖的血脉，在你身上留下了不可磨灭的印记，使你充满了奥秘魔法。戏法：在1级时，你知晓四个从术士法术列表自选的戏法。一环或更高环的已知法术：你知晓二个从术士法术列表中自选的1环法术。",
        "level": 1,
        "choices": [
          {
            "id": "spells-step-cantrips",
            "name": "选择四个术士戏法",
            "chooseNumber": 4,
            "dynamic": "spell",
            "spellType": "cantrip",
            "spellList": "sorcerer"
          },
          {
            "id": "spells-step-leveled",
            "name": "选择两个1环术士法术",
            "chooseNumber": 2,
            "dynamic": "spell",
            "spellType": "known",
            "spellList": "sorcerer",
            "maxLevel": 1
          }
        ]
      },
      {
        "name": "术法起源",
        "description": "从可选的起源列表中选择一个术法起源，它代表着你天生魔法力量的来源。你的选择会在1级、6级、14级、和18级的时候赋予你新的能力。",
        "level": 1
      },
      {
        "name": "魔力泉涌",
        "description": "在2级时，你挖掘出深埋于你体内的魔力涌泉。这道魔力涌泉以术法点的形式呈现。你拥有2点术法点，随等级提升增加。你可以使用术法点来创造法术位或将法术位转化为术法点。",
        "level": 2
      },
      {
        "name": "超魔法",
        "description": "在3级时，你获得扭曲你的法术以使其符合你需求的能力。你获得下列超魔法选项中的二个。10级、17级再各获一个。",
        "level": 3,
        "choices": [
          {
            "id": "sorcerer-metamagic-3",
            "name": "选择两个超魔法选项",
            "chooseNumber": 2,
            "options": [
              {
                "id": "metamagic-careful",
                "name": "谨慎法术",
                "description": "当你施展一个需要生物进行豁免检定的法术时，你可以保护其中一些生物使其免受法术的全部效果。为此，你花费 1 点术法点并选择数值至多等于你魅力调整值的生物（最少 1 个）。选中的生物在该法术的豁免检定中自动成功。"
              },
              {
                "id": "metamagic-distant",
                "name": "远程法术",
                "description": "当你施展一个射程为 5 尺或更远的法术时，你可以花费 1 点术法点使该法术的射程翻倍。当你施展一个射程为触及的法术时，你可以花费 1 点术法点使该法术的射程变为 30 尺。"
              },
              {
                "id": "metamagic-empowered",
                "name": "强效法术",
                "description": "当你进行法术的伤害掷骰时，你可以花费 1 点术法点重掷至多等于你魅力调整值的伤害骰（最少 1 个）。你必须使用重掷后的结果。你可以在使用了其他超魔法选项后依然使用强效法术。"
              },
              {
                "id": "metamagic-extended",
                "name": "延时法术",
                "description": "当你施展一个持续时间为 1 分钟或更长的法术时，你可以花费 1 点术法点使其持续时间翻倍，但最高不超过 24 小时。"
              },
              {
                "id": "metamagic-heightened",
                "name": "升阶法术",
                "description": "当你施展一个需要生物进行豁免检定以对抗其效果的法术时，你可以花费 3 点术法点，使该法术的一个目标在该法术的第一次豁免检定中处于劣势。"
              },
              {
                "id": "metamagic-quickened",
                "name": "瞬发法术",
                "description": "当你施展一个施法时间为 1 动作的法术时，你可以花费 2 点术法点将该次施法时间改为 1 附赠动作。"
              },
              {
                "id": "metamagic-subtle",
                "name": "精妙法术",
                "description": "当你施展一个法术时，你可以花费 1 点术法点来略去该法术的言语或姿势成分。"
              },
              {
                "id": "metamagic-twinned",
                "name": "孪生法术",
                "description": "当你施展一个只能靶向一个生物且其射程不为自身的法术时，你可以花费等同于该法术环阶数量的术法点（戏法为 1 点）来让该法术同时靶向范围内另一个第二个生物。"
              }
            ]
          }
        ]
      },
      {
        "name": "属性值提升",
        "description": "4级、8级、12级、16级、19级时获得属性值提升。",
        "level": 4,
        "choices": [
          {
            "id": "sorcerer-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "术法起源能力",
        "description": "在6级时，你获得一个由你术法起源所赋予的能力。",
        "level": 6
      },
      {
        "name": "超魔法",
        "description": "你在10级时再获得一个超魔法选项。",
        "level": 10,
        "choices": [
          {
            "id": "sorcerer-metamagic-10",
            "name": "选择一个额外的超魔法选项",
            "chooseNumber": 1,
            "options": [
              {
                "id": "metamagic-careful",
                "name": "谨慎法术",
                "description": "当你施展一个需要生物进行豁免检定的法术时，你可以保护其中一些生物使其免受法术的全部效果。为此，你花费 1 点术法点并选择数值至多等于你魅力调整值的生物（最少 1 个）。选中的生物在该法术的豁免检定中自动成功。"
              },
              {
                "id": "metamagic-distant",
                "name": "远程法术",
                "description": "当你施展一个射程为 5 尺或更远的法术时，你可以花费 1 点术法点使该法术的射程翻倍。当你施展一个射程为触及的法术时，你可以花费 1 点术法点使该法术的射程变为 30 尺。"
              },
              {
                "id": "metamagic-empowered",
                "name": "强效法术",
                "description": "当你进行法术的伤害掷骰时，你可以花费 1 点术法点重掷至多等于你魅力调整值的伤害骰（最少 1 个）。你必须使用重掷后的结果。你可以在使用了其他超魔法选项后依然使用强效法术。"
              },
              {
                "id": "metamagic-extended",
                "name": "延时法术",
                "description": "当你施展一个持续时间为 1 分钟或更长的法术时，你可以花费 1 点术法点使其持续时间翻倍，但最高不超过 24 小时。"
              },
              {
                "id": "metamagic-heightened",
                "name": "升阶法术",
                "description": "当你施展一个需要生物进行豁免检定以对抗其效果的法术时，你可以花费 3 点术法点，使该法术的一个目标在该法术的第一次豁免检定中处于劣势。"
              },
              {
                "id": "metamagic-quickened",
                "name": "瞬发法术",
                "description": "当你施展一个施法时间为 1 动作的法术时，你可以花费 2 点术法点将该次施法时间改为 1 附赠动作。"
              },
              {
                "id": "metamagic-subtle",
                "name": "精妙法术",
                "description": "当你施展一个法术时，你可以花费 1 点术法点来略去该法术的言语或姿势成分。"
              },
              {
                "id": "metamagic-twinned",
                "name": "孪生法术",
                "description": "当你施展一个只能靶向一个生物且其射程不为自身的法术时，你可以花费等同于该法术环阶数量的术法点（戏法为 1 点）来让该法术同时靶向范围内另一个第二个生物。"
              }
            ]
          }
        ]
      },
      {
        "name": "术法起源能力",
        "description": "在14级时，你获得一个由你术法起源所赋予的能力。",
        "level": 14
      },
      {
        "name": "超魔法",
        "description": "你在17级时再获得一个超魔法选项。",
        "level": 17,
        "choices": [
          {
            "id": "sorcerer-metamagic-17",
            "name": "选择一个额外的超魔法选项",
            "chooseNumber": 1,
            "options": [
              {
                "id": "metamagic-careful",
                "name": "谨慎法术",
                "description": "当你施展一个需要生物进行豁免检定的法术时，你可以保护其中一些生物使其免受法术的全部效果。为此，你花费 1 点术法点并选择数值至多等于你魅力调整值的生物（最修 1 个）。选中的生物在该法术的豁免检定中自动成功。"
              },
              {
                "id": "metamagic-distant",
                "name": "远程法术",
                "description": "当你施展一个射程为 5 尺或更远的法术时，你可以花费 1 点术法点使该法术的射程翻倍。当你施展一个射程为触及的法术时，你可以花费 1 点术法点使该法术的射程变为 30 尺。"
              },
              {
                "id": "metamagic-empowered",
                "name": "强效法术",
                "description": "当你进行法术的伤害掷骰时，你可以花费 1 点术法点重掷至多等于你魅力调整值的伤害骰（最少 1 个）。你必须使用重掷后的结果。你可以在使用了其他超魔法选项后依然使用强效法术。"
              },
              {
                "id": "metamagic-extended",
                "name": "延时法术",
                "description": "当你施展一个持续时间为 1 分钟或更长的法术时，你可以花费 1 点术法点使其持续时间翻倍，但最高不超过 24 小时。"
              },
              {
                "id": "metamagic-heightened",
                "name": "升阶法术",
                "description": "当你施展一个需要生物进行豁免检定以对抗其效果的法术时，你可以花费 3 点术法点，使该法术的一个目标在该法术的第一次豁免检定中处于劣势。"
              },
              {
                "id": "metamagic-quickened",
                "name": "瞬发法术",
                "description": "当你施展一个施法时间为 1 动作的法术时，你可以花费 2 点术法点将该次施法时间改为 1 附赠动作。"
              },
              {
                "id": "metamagic-subtle",
                "name": "精妙法术",
                "description": "当你施展一个法术时，你可以花费 1 点术法点来略去该法术的言语或姿势成分。"
              },
              {
                "id": "metamagic-twinned",
                "name": "孪生法术",
                "description": "当你施展一个只能靶向一个生物且其射程不为自身的法术时，你可以花费等同于该法术环阶数量的术法点（戏法为 1 点）来让该法术同时靶向范围内另一个第二个生物。"
              }
            ]
          }
        ]
      },
      {
        "name": "术法起源能力",
        "description": "在18级时，你获得一个由你术法起源所赋予的能力。",
        "level": 18
      },
      {
        "name": "术法复原",
        "description": "在20级时，每当你完成一次短休，你将恢复4点花费掉的术法点。",
        "level": 20
      }
    ],
    "spellcasting": {
      "type": "known",
      "ability": "CHA",
      "cantripsKnown": [
        4,
        4,
        4,
        5,
        5,
        5,
        5,
        5,
        5,
        6,
        6,
        6,
        6,
        6,
        6,
        6,
        6,
        6,
        6,
        6
      ],
      "spellsKnown": [
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        12,
        13,
        13,
        14,
        14,
        15,
        15,
        15,
        15
      ],
      "spellSlots": [
        [
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          3,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          2,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          1,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          2,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          1,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          1,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          2,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          2,
          2,
          1,
          1
        ]
      ],
      "spellList": "sorcerer"
    },
    "subclassAvailableAtLevel": 1,
    "subclasses": [
      {
        "id": "draconic",
        "name": "龙族血脉",
        "description": "你的天生魔法来自于与你或你祖先那与龙族魔法交缠的血脉。大多数情况下，这种起源的术士可以追溯其血统到久远以前与龙族交易、或有着龙族双亲的强大术士。",
        "traits": [
          {
            "name": "龙族血统",
            "description": "你选择一个龙种作为你的血统。各龙种对应的伤害类型将会在你往后获得的能力中被使用。你能够说、读、写龙语。此外，每当你在与龙族交互时进行魅力检定，若你的熟练加值能适用于该检定，你的熟练加值变为二倍。",
            "level": 1,
            "choices": [
              {
                "id": "draconic-ancestry",
                "name": "选择龙族祖先",
                "chooseNumber": 1,
                "options": [
                  {
                    "id": "black",
                    "name": "黑龙 (强酸)"
                  },
                  {
                    "id": "blue",
                    "name": "蓝龙 (闪电)"
                  },
                  {
                    "id": "brass",
                    "name": "黄铜龙 (火焰)"
                  },
                  {
                    "id": "bronze",
                    "name": "青铜龙 (闪电)"
                  },
                  {
                    "id": "copper",
                    "name": "赤铜龙 (强酸)"
                  },
                  {
                    "id": "gold",
                    "name": "金龙 (火焰)"
                  },
                  {
                    "id": "green",
                    "name": "绿龙 (毒素)"
                  },
                  {
                    "id": "red",
                    "name": "红龙 (火焰)"
                  },
                  {
                    "id": "silver",
                    "name": "银龙 (冷冻)"
                  },
                  {
                    "id": "white",
                    "name": "白龙 (冷冻)"
                  }
                ]
              }
            ]
          },
          {
            "name": "龙族韧性",
            "description": "因为魔法在你体内流动，你龙族血统的物理特征开始浮现。你的生命值最大值增加1点，且每当你在本职业提升等级时都会再增加1点。此外，你一部分的肌肤将会被轻薄、龙族般的光滑鳞片给覆盖。当你未穿戴护甲时，你的AC等于13 + 你的敏捷调整值。",
            "level": 1
          },
          {
            "name": "元素亲和",
            "description": "当你施放一个会造成与你龙族血统对应伤害类型相同的伤害的法术时，你可以将你的魅力调整值加入该法术的其中一个伤害骰中。同时，你可以消耗1点术法点以获得对该伤害类型的抗性长达1小时。",
            "level": 6
          },
          {
            "name": "龙之翼",
            "description": "你获得从你背后长出一对龙翼的能力，获得等同于你当下速度的飞行速度。你可以在你的回合以一个附赠动作创造这对龙翼。它们会持续直到你在你的回合以一个附赠动作解消它们。",
            "level": 14
          },
          {
            "name": "真龙威仪",
            "description": "消耗5点术法点，散发出距离60尺的敬畏或恐惧灵光，持续1分钟。每个在这道灵光中开始它回合的敌意生物必须成功通过一次感知豁免，否则被魅惑（若选择敬畏）或恐惧（若选择恐惧）。",
            "level": 18
          }
        ],
        "source": "phb"
      },
      {
        "id": "wild",
        "name": "狂野魔法",
        "description": "狂野魔法道途将狂暴无边的怒火同妖精荒野或混沌物质界的混乱魔力激烈共鸣。每当进入狂暴，周遭气流将爆发光怪陆离的随机法术涟漪，提供变幻莫测的战斗加持。",
        "traits": [
          {
            "name": "狂野魔法浪涌",
            "description": "你的施法可以释放出未经驯服的魔法浪涌。紧接在你施放一个1环或更高环的术士法术后，DM可以要求你骰一颗d20。若你骰出了1，则掷骰使用狂野魔法浪涌表以创造出一个随机的魔法效果。完整的浪涌效果表请查阅 [狂野魔法浪涌表](https://5e.dickytwister.org/classes.html#术士_phb,state:sub-wild-magic-phb=b1)。",
            "level": 1
          },
          {
            "name": "混乱之潮",
            "description": "你可以操作几率和混乱之力以在一次攻击检定、属性检定、或豁免检定中获得优势。一旦你这么做，你必须在完成一次长休后才能再使用此能力。",
            "level": 1
          },
          {
            "name": "窜改运气",
            "description": "当另一个你所能看见的生物进行一次攻击检定、属性检定、或豁免检定时，你可以使用你的反应并消耗2点术法点，骰1d4并将掷骰结果作为加值或减值加入该生物的检定结果。",
            "level": 6
          },
          {
            "name": "控制混沌",
            "description": "每当你掷骰使用狂野魔法浪涌表时，你可以重骰二次并使用其中一个掷骰结果。",
            "level": 14
          },
          {
            "name": "法术轰击",
            "description": "你法术的伤害性能量明显加剧。当你会一个法术掷骰决定伤害，且其中任何一颗骰子骰出了最大的骰面，则从这些骰子中选择一颗，重骰它并将其掷骰结果加到伤害中。",
            "level": 18
          }
        ],
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "CHA",
          "min": 13
        }
      ],
      "proficiencies": {}
    }
  },
  {
    "id": "warlock",
    "name": "契术师",
    "description": "借由与古老神秘的契约方（如恶魔、精类、旧日支配者）立下誓约而获得力量的施法者。他们拥有强大的魔能与诸多奇怪的祈唤能力，通常能在战斗中频密施展招牌戏法则来摧毁敌人。",
    "hitDie": 8,
    "primaryAbility": [
      "CHA"
    ],
    "saves": [
      "WIS",
      "CHA"
    ],
    "armorProficiencies": [
      "轻甲"
    ],
    "weaponProficiencies": [
      "简易武器"
    ],
    "toolProficiencies": [],
    "skills": {
      "count": 2,
      "choices": [
        "奥秘",
        "欺瞒",
        "历史",
        "威吓",
        "调查",
        "自然",
        "宗教"
      ]
    },
    "startingEquipment": [
      "(a)一把轻弩和20支弩矢 或 (b)任意一把简易武器",
      "(a)一个材料包 或 (b)一个奥术法器",
      "(a)一套学者套装 或 (b)一套地城探险家套装",
      "一件皮甲、任意一把简易武器、以及二把匕首"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "warlock-skills",
            "name": "选择 2 个技能熟练",
            "chooseNumber": 2,
            "options": [
              {
                "id": "arcana",
                "name": "奥秘"
              },
              {
                "id": "deception",
                "name": "欺瞒"
              },
              {
                "id": "history",
                "name": "历史"
              },
              {
                "id": "intimidation",
                "name": "威吓"
              },
              {
                "id": "investigation",
                "name": "调查"
              },
              {
                "id": "nature",
                "name": "自然"
              },
              {
                "id": "religion",
                "name": "宗教"
              }
            ]
          },
          {
            "id": "warlock-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把轻弩和20支弩矢"
              },
              {
                "id": "opt-1",
                "name": "(b)任意一把简易武器"
              }
            ]
          },
          {
            "id": "warlock-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一个材料包"
              },
              {
                "id": "opt-1",
                "name": "(b)一个奥术法器"
              }
            ]
          },
          {
            "id": "warlock-equip-2",
            "name": "装备组 3 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一套学者套装"
              },
              {
                "id": "opt-1",
                "name": "(b)一套地城探险家套装"
              }
            ]
          },
          {
            "id": "warlock-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "契约魔法",
        "description": "你的秘法研究和宗主赐予你的魔法给予了你施展法术的能力。你以短休恢复所有法术位，且总是以最高环阶施放。",
        "level": 1,
        "choices": [
          {
            "id": "spells-step-cantrips",
            "name": "选择两个契术师戏法",
            "chooseNumber": 2,
            "dynamic": "spell",
            "spellType": "cantrip",
            "spellList": "warlock"
          },
          {
            "id": "spells-step-leveled",
            "name": "选择两个1环契术师法术",
            "chooseNumber": 2,
            "dynamic": "spell",
            "spellType": "known",
            "spellList": "warlock",
            "maxLevel": 1
          }
        ]
      },
      {
        "name": "异界宗主",
        "description": "在1级时，你与一位异界存在签下了契约。你的选择将在1级、6级、10级、和14级时赐予你新的能力。",
        "level": 1
      },
      {
        "name": "魔能祈唤",
        "description": "在2级时，你发掘出二个魔能祈唤，一种赋予你恒久魔法能力的禁忌知识。当升至特定等级时，你将再获得额外的祈唤。",
        "level": 2
      },
      {
        "name": "契约恩赐",
        "description": "3级时，从锋刃魔契（召唤武器）、锁链魔契（强化魔宠）、书卷魔契（影之书）中选择一项。",
        "level": 3,
        "choices": [
          {
            "id": "pact-boon",
            "name": "选择一项契约恩赐",
            "chooseNumber": 1,
            "options": [
              {
                "id": "pact-of-the-blade",
                "name": "锋刃魔契",
                "description": "召唤一把契约武器到你空着的手中。"
              },
              {
                "id": "pact-of-the-chain",
                "name": "锁链魔契",
                "description": "学习寻获魔宠法术，且你可以选择伪龙、小魔鬼、夸塞魔、或小精灵作为你的魔宠。"
              },
              {
                "id": "pact-of-the-tome",
                "name": "书卷魔契",
                "description": "获得一本暗影之书，选择任意职业的三个戏法，当此书在身时可以随意施展。"
              }
            ]
          }
        ]
      },
      {
        "name": "属性值提升",
        "description": "4级、8级、12级、16级、19级时获得属性值提升。",
        "level": 4,
        "choices": [
          {
            "id": "warlock-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "异界宗主能力",
        "description": "在6级时，你获得一个由你异界宗主所赐予的能力。",
        "level": 6
      },
      {
        "name": "异界宗主能力",
        "description": "在10级时，你获得一个由你异界宗主所赐予的能力。",
        "level": 10
      },
      {
        "name": "玄奥秘法(6环)",
        "description": "11级时，选择一个6环法术作为秘法，无需法术位施放一次，长休恢复。",
        "level": 11
      },
      {
        "name": "玄奥秘法(7环)",
        "description": "13级时获得7环秘法。",
        "level": 13
      },
      {
        "name": "异界宗主能力",
        "description": "在14级时，你获得一个由你异界宗主所赐予的能力。",
        "level": 14
      },
      {
        "name": "玄奥秘法(8环)",
        "description": "15级时获得8环秘法。",
        "level": 15
      },
      {
        "name": "玄奥秘法(9环)",
        "description": "17级时获得9环秘法。",
        "level": 17
      },
      {
        "name": "魔能大师",
        "description": "20级时，你可以花费1分钟恳求宗主恢复所有已消耗的契约魔法法术位。长休恢复使用。",
        "level": 20
      }
    ],
    "spellcasting": {
      "type": "known",
      "ability": "CHA",
      "cantripsKnown": [
        2,
        2,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      "spellsKnown": [
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        10,
        11,
        11,
        12,
        12,
        13,
        13,
        14,
        14,
        15,
        15
      ],
      "spellSlots": [
        [
          1,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          0,
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          0,
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          0,
          0,
          2,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          0,
          0,
          2,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          0,
          0,
          0,
          2,
          0,
          0,
          0,
          0,
          0
        ],
        [
          0,
          0,
          0,
          2,
          0,
          0,
          0,
          0,
          0
        ],
        [
          0,
          0,
          0,
          0,
          2,
          0,
          0,
          0,
          0
        ],
        [
          0,
          0,
          0,
          0,
          2,
          0,
          0,
          0,
          0
        ],
        [
          0,
          0,
          0,
          0,
          2,
          1,
          0,
          0,
          0
        ],
        [
          0,
          0,
          0,
          0,
          2,
          1,
          0,
          0,
          0
        ],
        [
          0,
          0,
          0,
          0,
          2,
          1,
          1,
          0,
          0
        ],
        [
          0,
          0,
          0,
          0,
          2,
          1,
          1,
          0,
          0
        ],
        [
          0,
          0,
          0,
          0,
          2,
          1,
          1,
          1,
          0
        ],
        [
          0,
          0,
          0,
          0,
          2,
          1,
          1,
          1,
          0
        ],
        [
          0,
          0,
          0,
          0,
          2,
          1,
          1,
          1,
          1
        ],
        [
          0,
          0,
          0,
          0,
          2,
          1,
          1,
          1,
          1
        ],
        [
          0,
          0,
          0,
          0,
          2,
          1,
          1,
          1,
          1
        ],
        [
          0,
          0,
          0,
          0,
          2,
          1,
          1,
          1,
          1
        ]
      ],
      "spellList": "warlock"
    },
    "subclassAvailableAtLevel": 1,
    "subclasses": [
      {
        "id": "fiend",
        "name": "邪魔宗主",
        "description": "你与一个来自下层位面的邪魔缔结了契约。这类存在渴望着世间万物的腐化或破坏。",
        "traits": [
          {
            "name": "扩展法术列表",
            "description": "你的宗主让你可以从扩展法术列表中选择法术。",
            "level": 1
          },
          {
            "name": "黑暗者赐福",
            "description": "当你将一个敌对生物的生命值归零时，你获得等同于你魅力调整值 + 你契术师等级的临时生命值（最少为1）。",
            "level": 1
          },
          {
            "name": "黑暗者强运",
            "description": "当你进行一次属性检定或豁免检定时，可以此能力将一颗d10加入掷骰结果中。短休或长休恢复。",
            "level": 6
          },
          {
            "name": "邪魔韧性",
            "description": "完成一次短休或长休时选择一种伤害类型，获得对该伤害的抗性，直到你再次使用此能力。",
            "level": 10
          },
          {
            "name": "直堕地狱",
            "description": "当你以一次攻击命中一个生物，可以立刻将该目标传送穿过下层位面。下回合结束时目标返回并受到10d10心灵伤害。长休恢复。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "archfey",
        "name": "至高妖精",
        "description": "你的宗主是一位妖精领主或女爵，一个掌握着被遗忘秘密的传说生物。这个存在的行为动机往往难以理解，有时反复无常。",
        "traits": [
          {
            "name": "妖精威仪",
            "description": "以一个动作，使10尺立方范围内的生物进行一次感知豁免，失败则被你魅惑或恐惧直到你的下个回合结束。短休或长休恢复。",
            "level": 1
          },
          {
            "name": "雾遁",
            "description": "每当你受到伤害时，你可以使用你的反应变得隐形，并传送最远60尺。隐形持续到下回合开始或攻击/施法。短休或长休恢复。",
            "level": 6
          },
          {
            "name": "迷惑防护",
            "description": "你免疫于魅惑，且当另一个生物尝试魅惑你时，你可以使用你的反应以将该魅惑效果返还给该生物。",
            "level": 10
          },
          {
            "name": "黑暗妄雾",
            "description": "以动作使60尺内生物迷失在幻象迷雾中，被你魅惑或恐惧1分钟。短休或长休恢复。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "great-old-one",
        "name": "旧日支配者",
        "description": "你的宗主是一个对现实维度而言彻底异质的神秘存在。它可能来自遥远国度、现实之外的宇宙，或只记述于远古传说中的古神。",
        "traits": [
          {
            "name": "唤醒心灵",
            "description": "你可以对距离你30尺内且你所能看见的一个生物通过心灵感应交谈。你不需要与该生物有共通的语言。",
            "level": 1
          },
          {
            "name": "熵光防护",
            "description": "当一个生物对你进行一次攻击检定时，你可以使用你的反应以让该检定承受劣势。若攻击失手，则直到你的下个回合结束前，你下一次对该生物的攻击检定获得优势。短休或长休恢复。",
            "level": 6
          },
          {
            "name": "思想护盾",
            "description": "除非你允许，否则你的思想不会被阅读。你获得对心灵伤害的抗性，且对你造成心灵伤害的生物将受到与你相同的伤害。",
            "level": 10
          },
          {
            "name": "创造奴仆",
            "description": "触碰一个处于无力状态的类人生物，该生物接着将被你魅惑，持续直到被施放移除诅咒或你再次使用此能力。你可以通过心灵感应与被魅惑的生物交谈。",
            "level": 14
          }
        ],
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "CHA",
          "min": 13
        }
      ],
      "proficiencies": {
        "armor": [
          "轻甲"
        ],
        "weapons": [
          "简易武器"
        ]
      }
    }
  },
  {
    "id": "wizard",
    "name": "法师",
    "description": "终生研读着浩瀚魔法学说，并通过书写下各色强力法术来掌控现实的学者专家。只需一本详实的法术书，他们即可操控元素、迷惑意识、开启异次元通道甚至复活死者。",
    "hitDie": 6,
    "primaryAbility": [
      "INT"
    ],
    "saves": [
      "INT",
      "WIS"
    ],
    "armorProficiencies": [
      "无"
    ],
    "weaponProficiencies": [
      "匕首",
      "飞镖",
      "投石索",
      "长棍",
      "轻弩"
    ],
    "toolProficiencies": [],
    "skills": {
      "count": 2,
      "choices": [
        "奥秘",
        "历史",
        "洞悉",
        "调查",
        "医疗",
        "宗教"
      ]
    },
    "startingEquipment": [
      "(a)一把长棍 或 (b)一把匕首",
      "(a)一个材料包 或 (b)一个奥术法器",
      "(a)一套学者套装 或 (b)一套探索者套装",
      "一本法术书"
    ],
    "traits": [
      {
        "name": "初始装备与技能选项",
        "description": "在1级时，选择你的技能熟练项与初始装备获取方式。",
        "level": 1,
        "choices": [
          {
            "id": "wizard-skills",
            "name": "选择 2 个技能熟练",
            "chooseNumber": 2,
            "options": [
              {
                "id": "arcana",
                "name": "奥秘"
              },
              {
                "id": "history",
                "name": "历史"
              },
              {
                "id": "insight",
                "name": "洞悉"
              },
              {
                "id": "investigation",
                "name": "调查"
              },
              {
                "id": "medicine",
                "name": "医疗"
              },
              {
                "id": "religion",
                "name": "宗教"
              }
            ]
          },
          {
            "id": "wizard-equip-0",
            "name": "装备组 1 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一把长棍"
              },
              {
                "id": "opt-1",
                "name": "(b)一把匕首"
              }
            ]
          },
          {
            "id": "wizard-equip-1",
            "name": "装备组 2 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一个材料包"
              },
              {
                "id": "opt-1",
                "name": "(b)一个奥术法器"
              }
            ]
          },
          {
            "id": "wizard-equip-2",
            "name": "装备组 3 选择",
            "chooseNumber": 1,
            "options": [
              {
                "id": "opt-0",
                "name": "(a)一套学者套装"
              },
              {
                "id": "opt-1",
                "name": "(b)一套探索者套装"
              }
            ]
          },
          {
            "id": "wizard-wealth-method",
            "name": "装备获取方式",
            "chooseNumber": 1,
            "options": [
              {
                "id": "standard",
                "name": "使用职业与背景自带的起始装备"
              },
              {
                "id": "gold",
                "name": "自购装备 (使用起始资金 Roll: 起始资金)"
              }
            ]
          }
        ]
      },
      {
        "name": "奥术恢复",
        "description": "你学会了通过研读法术书来恢复失去魔法能量的方法。每天一次，短休后可恢复总环阶不超过法师等级一半的法术位。",
        "level": 1
      },
      {
        "name": "施法",
        "description": "作为一介奥术魔法的学生，你拥有一本记载着法术的法术书。戏法：在1级时，你知晓三个从法师法术列表自选的戏法。\n\n法术书\n在1级时，你拥有一本载有六个自选的1环法师法术的法术书。你的法术书是保存着你已知法师法术的容器；除了你的戏法之外，戏法则直接被记忆在你的心中。\n\n准备及施放法术\n法师表中显示了你有多少个法术位可以用来施放你一环或更高环的法师法术。要施放其中一个这些法术，你必须消耗一个与该法术环阶相同或更高的法术位。你在完成一次长休后恢复所有你花费掉的法术位。\n\n你准备一份你所能施放法师法术的列表。当你这么做时，从你的法术书中选择数量等同于你智力调整值 + 你法师等级的法师法术（最少一个法术）。这些法术的环阶都必须符合你所拥有法术位的环阶。\n\n举例来说，如果你是一个3级的法师，你拥有四个1环和二个2环的法术位。你的智力为16，则你已准备法术的列表中可以包含总共六个1环或2环的法术。若你准备了1环法术魔法飞弹，你可以使用1环和2环的法术位来施放它。施放法术并不会将它从你的准备法术列表中移除。\n\n你可以在你完成一次长休时改变你的准备法术列表。准备一份新的法师法术列表需要花费时间于研读你的法术书并记忆你施放该法术所必须的咒语和姿势：你需要为你列表上每个法术的每个环阶都花费至少1分钟的时间。",
        "level": 1,
        "choices": [
          {
            "id": "spells-step-cantrips",
            "name": "选择三个法师戏法",
            "chooseNumber": 3,
            "dynamic": "spell",
            "spellType": "cantrip",
            "spellList": "wizard"
          },
          {
            "id": "wizard-spellbook-1",
            "name": "选择法师法术加入法术书（随等级增加可选法术与环阶）",
            "chooseNumber": 6,
            "dynamic": "spell",
            "spellType": "spellbook",
            "spellList": "wizard"
          }
        ]
      },
      {
        "name": "奥法学派",
        "description": "当你升至2级时，你从可选的学派列表中选择一个奥法学派。你的选择会在2级、6级、10级、和14级的时候赋予你新的能力。",
        "level": 2
      },
      {
        "name": "属性值提升",
        "description": "4级、8级、12级、16级、19级时获得属性值提升。",
        "level": 4,
        "choices": [
          {
            "id": "wizard-asi-4",
            "name": "选择提升属性或专长",
            "chooseNumber": 1,
            "dynamic": "asi"
          }
        ]
      },
      {
        "name": "奥法学派能力",
        "description": "在6级时，你获得一个由你奥法学派所赋予的能力。",
        "level": 6
      },
      {
        "name": "奥法学派能力",
        "description": "在10级时，你获得一个由你奥法学派所赋予的能力。",
        "level": 10
      },
      {
        "name": "奥法学派能力",
        "description": "在14级时，你获得一个由你奥法学派所赋予的能力。",
        "level": 14
      },
      {
        "name": "法术精通",
        "description": "18级时，选择你法术书中的1环和2环法术各一，你能够以最低环阶随意施放它们而无需消耗法术位。",
        "level": 18
      },
      {
        "name": "招牌法术",
        "description": "20级时，选择你法术书中的二个3环法术作为你的招牌法术。你永远视作已经准备了它们，且可以各自免费施放一次，短休或长休后恢复。",
        "level": 20
      }
    ],
    "spellcasting": {
      "type": "prepared",
      "ability": "INT",
      "cantripsKnown": [
        3,
        3,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        5,
        5,
        5,
        5,
        5,
        5,
        5,
        5,
        5,
        5,
        5
      ],
      "spellSlots": [
        [
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          3,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          2,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          2,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          0,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          1,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          2,
          0,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          1,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          0,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          0,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          0,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          0
        ],
        [
          4,
          3,
          3,
          3,
          2,
          1,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          1,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          2,
          1,
          1,
          1
        ],
        [
          4,
          3,
          3,
          3,
          3,
          2,
          2,
          1,
          1
        ]
      ],
      "spellList": "wizard"
    },
    "subclassAvailableAtLevel": 2,
    "subclasses": [
      {
        "id": "abjuration",
        "name": "防护学派",
        "description": "防护学派强调着阻挡、驱逐、或守护的魔法。这个学派的成员又被称作防护师，且当邪灵需要被祛除、当重要场所需要被杜绝魔法探测、以及当通向其他存在位面的传送门需要被关闭时，人们总会找上他们。",
        "traits": [
          {
            "name": "防护学者",
            "description": "你在将防护系法术抄写进你的法术书时所必须花费的金钱和时间减半。",
            "level": 2
          },
          {
            "name": "奥法防护",
            "description": "当你施放一个1环或更高环的防护系法术时，你可以利用该法术的一缕魔法在你身上创造出一道魔法防护结界，持续直到你完成一次长休。这道防护结界具有等同于你法师等级二倍 + 你的智力调整值的生命值。每当你受到伤害时，这道防护结界将代替你承受伤害。",
            "level": 2
          },
          {
            "name": "投射防护",
            "description": "当一个距离你30尺内且你所能看见的生物受到伤害，你可以使用你的反应以让你的奥法防护吸收该伤害。若该伤害将防护结界的生命值归零，则被防护的生物将受到任何剩余的伤害。",
            "level": 6
          },
          {
            "name": "精通防护",
            "description": "当你施放一个在施放过程中需要你进行属性检定的防护系法术时（例如反制法术和解除魔法），你可以将你的熟练加值加入该属性检定中。",
            "level": 10
          },
          {
            "name": "法术抗性",
            "description": "你在对抗法术的豁免检定中具有优势。此外，你对法术伤害具有抗性。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "conjuration",
        "name": "咒法学派",
        "description": "作为一名咒法师，你偏好于凭空产生出物体和生物的法术。你可以唤来翻腾的致死云雾、或召唤出来自别处的生物为你作战。",
        "traits": [
          {
            "name": "咒法学者",
            "description": "你在将咒法系法术抄写进你的法术书时所必须花费的金钱和时间减半。",
            "level": 2
          },
          {
            "name": "次级咒唤",
            "description": "你可以使用你的动作以唤出一个无生命物体，让其出现在你手上、或出现在距离你10尺内你所能看见的一处未被占据空间的地面上。",
            "level": 2
          },
          {
            "name": "移形换位",
            "description": "你可以使用你的动作以传送最多30尺距离到一处你所能看见的未被占据空间。或者，你可以选择范围内一处被一个中型或小型生物给占据的空间，与该生物交换位置。",
            "level": 6
          },
          {
            "name": "咒法专注",
            "description": "当你专注于一个咒法系法术时，你的专注并不会因为受到伤害而被中断。",
            "level": 10
          },
          {
            "name": "强韧召唤",
            "description": "任何你以咒法系法术召唤或创造出的生物都将拥有30点临时生命值。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "divination",
        "name": "预言学派",
        "description": "作为一名预言师，你致力于揭开时间、空间、和意识的神秘面纱以让你能看得更清楚。你努力掌握那些与识别、远视、超自然知识，和预知未来有关的法术。",
        "traits": [
          {
            "name": "预言学者",
            "description": "你在将预言系法术抄写进你的法术书时所必须花费的金钱和时间减半。",
            "level": 2
          },
          {
            "name": "预兆",
            "description": "当你完成一次长休时，骰二颗d20记录下来。你可以将你或一个你所能看见的生物所进行的任意攻击检定、豁免检定、或属性检定的结果替换成其中一颗这些预言骰的结果。",
            "level": 2
          },
          {
            "name": "预言专家",
            "description": "当你使用法术位施放一个2环或更高环的预言系法术，你将恢复一个已消耗的法术位。",
            "level": 6
          },
          {
            "name": "天眼通",
            "description": "你可以使用你的动作以增强你感知周遭的能力：获得高等理解能力、黑暗视觉、识破隐形、或乙太视界。",
            "level": 10
          },
          {
            "name": "高等预兆",
            "description": "你为你的预兆能力骰三颗骰，而非原本的二颗。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "enchantment",
        "name": "惑控学派",
        "description": "作为惑控学派的成员，你磨练你的能力于借由魔法迷惑并欺骗其他人和怪物。一部份的惑控师是和平主义者，另一些则是暴君。",
        "traits": [
          {
            "name": "惑控学者",
            "description": "你在将惑控系法术抄写进你的法术书时所必须花费的金钱和时间减半。",
            "level": 2
          },
          {
            "name": "催眠凝视",
            "description": "你的柔和言语和魅惑凝视可以用魔法迷住另一个生物。以一个动作，选择一个距离你5尺内且你能看见的生物使其被魅惑。",
            "level": 2
          },
          {
            "name": "本能魅惑",
            "description": "当一个距离你30尺内且你所能看见的生物对你进行一次攻击检定，只要有另一个生物处于该攻击的射程内，你可以使用你的反应以将该攻击转向。",
            "level": 6
          },
          {
            "name": "分散惑控",
            "description": "当你施放一个只以一个生物作为目标的1环或更高环的惑控系法术时，你可以让该法术指定第二个生物作为目标。",
            "level": 10
          },
          {
            "name": "改动记忆",
            "description": "你获得让一个生物无法察觉你用魔法影响它的能力。此外，并能尝试抹除该生物被魅惑期间的记忆。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "evocation",
        "name": "塑能学派",
        "description": "你专注于研究能创造出强大元素效果的魔法，诸如刺骨寒冷、炽热火焰、轰隆雷鸣、跃动闪电、和烧灼强酸。",
        "traits": [
          {
            "name": "塑能学者",
            "description": "你在将塑能系法术抄写进你的法术书时所必须花费的金钱和时间减半。",
            "level": 2
          },
          {
            "name": "形塑法术",
            "description": "你可以在你塑能系法术的效果范围内创造出相对安全的区域。当你施放一个会影响你所能看见的其他生物的塑能系法术时，你可以从中选择数量等同1 + 该法术环阶的生物使其免受伤害。",
            "level": 2
          },
          {
            "name": "强力戏法",
            "description": "即使生物避开了你伤害类戏法效果中最主要的冲击，你仍能影响它们。当一个生物成功通过一次对抗你戏法的豁免检定，该生物仍会受到该戏法的伤害（若有）的一半。",
            "level": 6
          },
          {
            "name": "强效塑能",
            "description": "你可以将你的智力调整值加入任何你所施放的塑能系法师法术的其中一次伤害骰中。",
            "level": 10
          },
          {
            "name": "重载导魔",
            "description": "你可以提升你那些较简单法术的威力。当你施放一个环阶在1环到5环之间，且会造成伤害的法师法术时，你可以让该法术造成最大伤害。多次使用会对自身造成黯蚀伤害。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "illusion",
        "name": "幻术学派",
        "description": "你专注于研究那些能够扰乱感官、迷惑意识、甚至能欺骗最有智能之人的魔法。你的魔法看似细微，但以假乱真。",
        "traits": [
          {
            "name": "幻术学者",
            "description": "你在将幻术系法术抄写进你的法术书时所必须花费的金钱和时间减半。",
            "level": 2
          },
          {
            "name": "精通次级幻象",
            "description": "你习得次级幻象戏法。当你施放次级幻象，你可以在一次施法中同时创造出声音和影像。",
            "level": 2
          },
          {
            "name": "可塑幻象",
            "description": "当你施放一个持续时间为1分钟或更久的幻术系法术时，只要你可以看见该幻象，你就可以改变该幻象的性质。",
            "level": 6
          },
          {
            "name": "幻象步",
            "description": "几乎等同你对危险的本能反应，你可以在瞬间创造出一个你的幻象拷贝体。当一个生物对你进行一次攻击检定，该攻击将自动失手，且该幻象将接着消散。",
            "level": 10
          },
          {
            "name": "亦真亦幻",
            "description": "你学会幽影魔法的奥秘，并能将之编入你的幻象中以赋予它们半真实的特性。该物体必须是不可动且非魔法的，并无法造成直接伤害。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "necromancy",
        "name": "死灵学派",
        "description": "死灵学派探索着生命、死亡、与不死之间的宇宙力量。随着你专注你的研究于这个传统，你学会了操纵那驱动所有活物的能量。",
        "traits": [
          {
            "name": "死灵学者",
            "description": "你在将死灵系法术抄写进你的法术书时所必须花费的金钱和时间减半。",
            "level": 2
          },
          {
            "name": "残怖收割",
            "description": "你获得从你以法术杀死的生物那里收割生命能量的能力。每回合一次，当你以1环或更高环的法术杀死一个或更多的生物时，你将获得等同于该法术环阶二倍的生命值（若死灵系则三倍）。",
            "level": 2
          },
          {
            "name": "不死奴仆",
            "description": "若你的法术书中没有活化死尸法术，你将它加入法术书中。施放时可额外创造一只不死生物，且你创造的不死生物将获得额外生命值和伤害加成。",
            "level": 6
          },
          {
            "name": "不死适应",
            "description": "你拥有对黯蚀伤害的抗性，且你的生命值最大值不会被减少。",
            "level": 10
          },
          {
            "name": "命令不死生物",
            "description": "你可以使用魔法让不死生物处于你的控制下。以一个动作，选择一个距离你60尺内且你所能看见的不死生物强行控制它。",
            "level": 14
          }
        ],
        "source": "phb"
      },
      {
        "id": "transmutation",
        "name": "变化学派",
        "description": "你驾驭着创造的原始材料，并学习如何改变物理形态和精神性质。你的魔法赋予你工具，使你得以成为现实世界这座锻造场的铁匠。",
        "traits": [
          {
            "name": "变化学者",
            "description": "你在将变化系法术抄写进你的法术书时所必须花费的金钱和时间减半。",
            "level": 2
          },
          {
            "name": "次级炼金",
            "description": "你可以暂时地改变一个非魔法物体的物理性质，将它变成另一种物质，如木、石、铁、铜或银，最多转换1立方尺的材质持续1小时。",
            "level": 2
          },
          {
            "name": "变化师之石",
            "description": "你可以花费8小时制造一颗保存着变化系魔法的变化师之石，赋予持有者黑暗视觉、增加移速、体质豁免熟练、或某种属性伤害抗性其中之一。",
            "level": 6
          },
          {
            "name": "变形者",
            "description": "若你的法术书中没有变形术法术，则将它加入。你可以施放变形术而无须消耗法术位，但只能以自己为目标，且只能转变为一个挑战等级为1或更低的野兽。",
            "level": 10
          },
          {
            "name": "变化宗师",
            "description": "你可以一次耗尽变化师之石内的魔法，以产生强效变化、万灵密药、起死回生、或返老还童的效果。",
            "level": 14
          }
        ],
        "source": "phb"
      }
    ],
    "source": "phb",
    "multiclass": {
      "requirements": [
        {
          "ability": "INT",
          "min": 13
        }
      ],
      "proficiencies": {}
    }
  }
];
